-------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/Sophia/Desktop/Research/Norma/ICinLTC/log/Table2_residentialfacility.log
  log type:  text
 opened on:  10 Dec 2021, 09:35:01

. 
. *\ Import datasets- 2016 Biennial and Longitudinal
. *1. Read in the 2016 Rand Biennial Data and select five variables
. use ph115 ph124 ph130 ph004 hhidpn using "$data/h16f2a.dta", clear

. tempfile 2016biennial

. save `2016biennial'
file /var/folders/0c/cmyfzq7x4zsbb_8fq5ly69ch0000gn/T//S_01662.000001 saved as .dta format

. *2. Load Rand HRS Longitudinal File 2016 and subset to only include wave13
. use inw13 r13agey_e r13nhmliv r13walkr r13dress r13bath r13eat r13bed r13toilt ///
> r13phone r13money r13meds r13shop r13meals hhidpn r13wtrespe using "$data/randhrs1992_2016v2.dta",cle
> ar

. keep if inw13==1
(21,140 observations deleted)

. tempfile 2016longitudinal

. save `2016longitudinal'
file /var/folders/0c/cmyfzq7x4zsbb_8fq5ly69ch0000gn/T//S_01662.000002 saved as .dta format

. *3. Merge two datasets
. use `2016longitudinal', clear

. merge 1:1 hhidpn using `2016biennial',gen (merge_1)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            20,912  (merge_1==3)
    -----------------------------------------

. distinct hhidpn 

-------------------------------
        |     total   distinct
--------+----------------------
 hhidpn |     20912      20912
-------------------------------

. *4. Sample restrictions
. keep if r13agey_e>=65
(10,918 observations deleted)

. 
. *\Generate Vars
. *1. Rename vars
. *** Rename PH115 (Group Meals) as Meals 
. tab ph115, m nolab 

group meals |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        240        2.40        2.40
          3 |          2        0.02        2.42
          4 |          7        0.07        2.49
          5 |        325        3.25        5.74
          8 |          4        0.04        5.78
          . |      9,416       94.22      100.00
------------+-----------------------------------
      Total |      9,994      100.00

. rename ph115 Meals

. *** Rename PH124 as ADLHELP
. tab ph124, m nolab 

bathing-dre |
ssing-eatin |
          g |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        153        1.53        1.53
          5 |        406        4.06        5.59
          8 |         10        0.10        5.69
          . |      9,425       94.31      100.00
------------+-----------------------------------
      Total |      9,994      100.00

. rename ph124 ADLHELP 

. *** Rename PH130 as NURSINGHELP
. tab ph130, m nolab 

    nursing |
       care |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        165        1.65        1.65
          5 |        398        3.98        5.63
          8 |          5        0.05        5.68
          9 |          1        0.01        5.69
          . |      9,425       94.31      100.00
------------+-----------------------------------
      Total |      9,994      100.00

. rename ph130 NURSINGHELP

. *** Rename PH004 as LTCRENT
. tab ph004, m nolab 

   own-rent |
       home |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      6,943       69.47       69.47
          2 |      1,624       16.25       85.72
          3 |        394        3.94       89.66
          7 |         61        0.61       90.27
          8 |          6        0.06       90.33
          9 |          9        0.09       90.42
          . |        957        9.58      100.00
------------+-----------------------------------
      Total |      9,994      100.00

. rename ph004 LTCRENT

. 
. *2. Formal Rensidential LTC Care
. *** Independent Living = Meals Yes, ADL HELP No, Nursing No, RENT Yes;
. gen IL = 0

. replace IL = 1 if Meals ==1 & ADLHELP ==5 & NURSINGHELP ==5 & LTCRENT ==2
(53 real changes made)

. tab IL, m 

         IL |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,941       99.47       99.47
          1 |         53        0.53      100.00
------------+-----------------------------------
      Total |      9,994      100.00

. *** Assisted Living = Meals Yes, ADL HELP Yes, Nursing No, RENT Yes;
. gen AL = 0

. replace AL = 1 if Meals ==1 & ADLHELP == 1 & NURSINGHELP ==5 & LTCRENT == 2
(22 real changes made)

. tab AL, m

         AL |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,972       99.78       99.78
          1 |         22        0.22      100.00
------------+-----------------------------------
      Total |      9,994      100.00

. *** Continuing Care Retirement Community = Meals Yes, ADL HELP Yes, Nursing Yes, RENT or Own (What ab
> out fee?)
. gen CCRC = 0 

. replace CCRC = 1 if Meals ==1 & ADLHELP ==1 & NURSINGHELP ==1
(111 real changes made)

. tab CCRC,m 

       CCRC |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,883       98.89       98.89
          1 |        111        1.11      100.00
------------+-----------------------------------
      Total |      9,994      100.00

. *** Combine three above because frequencies are so low for them separately
. gen FC_COMBO = 0

. replace FC_COMBO = 1 if CCRC ==1 | AL ==1 | IL ==1 
(186 real changes made)

. 
. *\Identify people who are currently living in a care facility
. keep if FC_COMBO ==1
(9,808 observations deleted)

. tab FC_COMBO, m //186 observations remain

   FC_COMBO |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        186      100.00      100.00
------------+-----------------------------------
      Total |        186      100.00

. *** Save as a tempfile
. tempfile rensidentialfacility

. save `rensidentialfacility'
file /var/folders/0c/cmyfzq7x4zsbb_8fq5ly69ch0000gn/T//S_01662.000003 saved as .dta format

. 
. 
. clear all

. *\ Import dataset- HRS 2016 core helper file
. infile using "$data/H16G_HP.dct", using("$data/H16G_HP.da")

dictionary using c:\hrs2016\data\H16G_HP.da {
* Note: change location of input file to match your situation.
 _column(1) str6 HHID %6s "HOUSEHOLD IDENTIFICATION NUMBER"
 _column(7) str3 PN %3s "RESPONDENT PERSON IDENTIFICATION NUMBER"
 _column(10) str1 PSUBHH %1s "2016 SUB HOUSEHOLD IDENTIFICATION NUMBER"
 _column(11) str1 OSUBHH %1s "2014 SUB HOUSEHOLD IDENTIFICATION NUMBER"
 _column(12) str3 PPN_SP %3s "2016 SPOUSE/PARTNER PERSON NUMBER"
 _column(15) byte PCSR %1.0f "2016 WHETHER COVERSHEET RESPONDENT"
 _column(16) byte PFAMR %1.0f "2016 WHETHER FAMILY RESPONDENT"
 _column(17) byte PFINR %1.0f "2016 WHETHER FINANCIAL RESPONDENT"
 _column(18) str3 OPN %3s "OTHER PERSON NUMBER"
 _column(21) byte PG069 %2.0f "HELPER RELATIONSHIP"
 _column(23) int PG066 %3.0f "WHO HELPED LOOP"
 _column(26) byte PADLNDX %1.0f "INDEX CONNECTION TO THE ADL TABLE"
 _column(27) byte PIADLNDX %1.0f "INDEX CONNECTION TO THE IADL TABLE"
 _column(28) byte PMNYNDX %1.0f "INDEX CONNECTION TO THE MONEY TABLE"
 _column(29) byte PG070 %2.0f "FREQ OF HELP GIVEN"
 _column(31) byte PG071 %1.0f "# DAYS HELPER HELPED"
 _column(32) byte PG072 %1.0f "DID HELPER HELP EVERY DY"
 _column(33) byte PG073 %2.0f "#HRS OF HELP"
 _column(35) byte PG074 %1.0f "HELPERS SEX"
 _column(36) str3 PG075 %3s "GRANDCHILD OF WHICH CHILD"
 _column(39) byte PG076 %1.0f "HELPER GIVEN MONEY TO HELP"
 _column(40) byte PG077 %1.0f "DOES INS PAY"
 _column(41) long PG078 %5.0f "AMT R/SP/P PAID"
 _column(46) byte PG079 %1.0f "AMT R/SP/P PAID HELPER"
 _column(47) byte PG080 %1.0f "AMT $100"
 _column(48) byte PG081 %1.0f "OTR FIN HELP"
 _column(49) byte PG082 %1.0f "HELPER=CHLD,REL,OTR"
 _column(50) str3 PG083 %3s "WHICH CHLD"
 _column(53) byte PVDATE %2.0f "2016 DATA MODEL VERSION"
 _column(55) byte PVERSION %1.0f "2016 DATA RELEASE VERSION"
}

(6,239 observations read)

. *1. Gen hhidpn using HHID and PN
. gen hhidpn = HHID+PN

. listsome hhidpn

      +-----------+
      |    hhidpn |
      |-----------|
   1. | 010003030 |
   2. | 010063010 |
   3. | 010099010 |
   4. | 010099010 |
   5. | 010106020 |
      |-----------|
   6. | 010106020 |
   7. | 010147010 |
   8. | 010210020 |
   9. | 010210020 |
  10. | 010210020 |
      |-----------|
  11. | 010210020 |
  12. | 010281010 |
  13. | 010281010 |
  14. | 010281010 |
  15. | 010395020 |
      |-----------|
  16. | 010395020 |
  17. | 010395020 |
  18. | 010433010 |
  19. | 010433010 |
  20. | 010433010 |
      +-----------+

. codebook hhidpn

-------------------------------------------------------------------------------------------------------
hhidpn                                                                                      (unlabeled)
-------------------------------------------------------------------------------------------------------

                  Type: String (str9)

         Unique values: 3,345                     Missing "": 0/6,239

              Examples: "051029010"
                        "159075010"
                        "213443010"
                        "541451020"

. destring hhidpn, replace
hhidpn: all characters numeric; replaced as long

. *2. Make 6 relationship categories from dozens of options for helper relationships
. gen rel_cat = 0

. replace rel_cat = 1 if inlist(PG069,21,22,23,24,25) //Professional
(882 real changes made)

. replace rel_cat = 2 if inlist(PG069,2,26,27) //Spouse/Partner
(1,388 real changes made)

. replace rel_cat = 3 if inlist(PG069,3,8) //Son/Daughter in Law
(1,011 real changes made)

. replace rel_cat = 4 if inlist(PG069,5,6) //Daughter/Son in law
(1,531 real changes made)

. replace rel_cat = 5 if inlist(PG069,4,7,9,10,11,12,13,14,15,16,17,18,19,28,30,31,33,90,91)
(986 real changes made)

. replace rel_cat = 6 if inlist(PG069,20,32,34,98)
(438 real changes made)

. replace rel_cat = 99 if PG069 == 98 //0 represents self
(0 real changes made)

. tab rel_cat, m

    rel_cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          3        0.05        0.05
          1 |        882       14.14       14.18
          2 |      1,388       22.25       36.43
          3 |      1,011       16.20       52.64
          4 |      1,531       24.54       77.18
          5 |        986       15.80       92.98
          6 |        438        7.02      100.00
------------+-----------------------------------
      Total |      6,239      100.00

. *3. Informal helpers
. gen Informal = 0

. replace Informal = 1 if PG076 == 5 & inlist(rel_cat,1,6,99)
(340 real changes made)

. replace Informal = 1 if inlist(rel_cat,2,3,4,5)
(4,916 real changes made)

. tab Informal,m

   Informal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        983       15.76       15.76
          1 |      5,256       84.24      100.00
------------+-----------------------------------
      Total |      6,239      100.00

. *4. Keep if Informal equals 1 AND keep unique IDs
. keep if Informal == 1
(983 observations deleted)

. distinct hhidpn //5,256 obs, 3131 distinct obs.

-------------------------------
        |     total   distinct
--------+----------------------
 hhidpn |      5256       3131
-------------------------------

. duplicates r

Duplicates in terms of all variables

--------------------------------------
   Copies | Observations       Surplus
----------+---------------------------
        1 |         5256             0
--------------------------------------

. bys hhidpn: gen dup = cond(_N==1,0,_n)

. tab dup,m

        dup |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,834       34.89       34.89
          1 |      1,297       24.68       59.57
          2 |      1,297       24.68       84.25
          3 |        496        9.44       93.68
          4 |        198        3.77       97.45
          5 |         81        1.54       98.99
          6 |         37        0.70       99.70
          7 |         14        0.27       99.96
          8 |          2        0.04      100.00
------------+-----------------------------------
      Total |      5,256      100.00

. drop if dup>1
(2,125 observations deleted)

. distinct hhidpn //3131 obs, good.

-------------------------------
        |     total   distinct
--------+----------------------
 hhidpn |      3131       3131
-------------------------------

. *5. Save as a temp file
. tempfile helper

. save `helper'
file /var/folders/0c/cmyfzq7x4zsbb_8fq5ly69ch0000gn/T//S_01662.000004 saved as .dta format

. *6. Merge with the RensidentialFacility
. use `rensidentialfacility',clear

. merge m:1 hhidpn using `helper', gen(merge_2)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,195
        from master                       125  (merge_2==1)
        from using                      3,070  (merge_2==2)

    Matched                                61  (merge_2==3)
    -----------------------------------------

. *7. Drop if merge_2 (unmatched from using)
. drop if merge_2==2
(3,070 observations deleted)

. *8. Save as a temp file
. tempfile FinalData

. save `FinalData'
file /var/folders/0c/cmyfzq7x4zsbb_8fq5ly69ch0000gn/T//S_01662.000005 saved as .dta format

. *9. Informal var: give NA a numeric number 0
. tab Informal, m

   Informal |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         61       32.80       32.80
          . |        125       67.20      100.00
------------+-----------------------------------
      Total |        186      100.00

. replace Informal = 0 if mi(Informal)
(125 real changes made)

. tab Informal, m

   Informal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        125       67.20       67.20
          1 |         61       32.80      100.00
------------+-----------------------------------
      Total |        186      100.00

. 
. 
. ****************************************************************************************************
. ***Table 2- Residential Facility***
. ***********************************
. *\ Mobility
. *\ Diff-Walk
. tab r13walkr, m nolab

r13walkr:w1 |
        3 r |
  diff-walk |
across room |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        149       80.11       80.11
          1 |         32       17.20       97.31
          2 |          3        1.61       98.92
          9 |          1        0.54       99.46
         .d |          1        0.54      100.00
------------+-----------------------------------
      Total |        186      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff
. gen walkdiff = 99

. replace walkdiff = 1 if inlist(r13walkr,1,2,9)
(36 real changes made)

. replace walkdiff = 0 if r13walkr ==0
(149 real changes made)

. tab walkdiff, m

   walkdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        149       80.11       80.11
          1 |         36       19.35       99.46
         99 |          1        0.54      100.00
------------+-----------------------------------
      Total |        186      100.00

. *2. % of people who need help
. tab walkdiff,m

   walkdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        149       80.11       80.11
          1 |         36       19.35       99.46
         99 |          1        0.54      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab walkdiff[iweight=r13wtrespe],m

   walkdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    685,460       79.18       79.18
          1 |    175,107       20.23       99.40
         99 |      5,153        0.60      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. *3. Identify people having diff received informal help
. gen walkdiffinformal = 0

. replace walkdiffinformal = 1 if walkdiff ==1 & Informal ==1
(23 real changes made)

. replace walkdiffinformal = 99 if walkdiff ==99
(1 real change made)

. tab walkdiffinformal, m

walkdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        162       87.10       87.10
          1 |         23       12.37       99.46
         99 |          1        0.54      100.00
------------+-----------------------------------
      Total |        186      100.00

. *4. % of people who need help and received informal help
. tab walkdiffinformal, m

walkdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        162       87.10       87.10
          1 |         23       12.37       99.46
         99 |          1        0.54      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab walkdiffinformal[iweight=r13wtrespe], m

walkdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    749,736       86.60       86.60
          1 |    110,831       12.80       99.40
         99 |      5,153        0.60      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if walkdiff ==1
(150 observations deleted)

. tab walkdiffinformal, m

walkdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         13       36.11       36.11
          1 |         23       63.89      100.00
------------+-----------------------------------
      Total |         36      100.00

. tab walkdiffinformal[iweight=r13wtrespe], m

walkdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     64,276       36.71       36.71
          1 |    110,831       63.29      100.00
------------+-----------------------------------
      Total |    175,107      100.00

. restore

. 
. **************************************************************
. *\ Diff-Bed
. tab r13bed, m nolab

 r13bed:w13 |
 r diff-get |
  in/out of |
        bed |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        167       89.78       89.78
          1 |         18        9.68       99.46
          2 |          1        0.54      100.00
------------+-----------------------------------
      Total |        186      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff
. gen beddiff = 99

. replace beddiff = 1 if inlist(r13bed,1,2,9)
(19 real changes made)

. replace beddiff = 0 if r13bed ==0
(167 real changes made)

. tab beddiff, m

    beddiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        167       89.78       89.78
          1 |         19       10.22      100.00
------------+-----------------------------------
      Total |        186      100.00

. *2. % of people who need help
. tab beddiff,m

    beddiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        167       89.78       89.78
          1 |         19       10.22      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab beddiff[iweight=r13wtrespe],m

    beddiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    791,600       91.44       91.44
          1 |     74,120        8.56      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. *3. Identify people having diff received informal help
. gen beddiffinformal = 0

. replace beddiffinformal = 1 if beddiff ==1 & Informal ==1
(12 real changes made)

. replace beddiffinformal = 99 if beddiff ==99
(0 real changes made)

. tab beddiffinformal, m

beddiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        174       93.55       93.55
          1 |         12        6.45      100.00
------------+-----------------------------------
      Total |        186      100.00

. *4. % of people who need help and received informal help
. tab beddiffinformal, m

beddiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        174       93.55       93.55
          1 |         12        6.45      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab beddiffinformal[iweight=r13wtrespe], m

beddiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    816,189       94.28       94.28
          1 |     49,531        5.72      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if beddiff ==1
(167 observations deleted)

. tab beddiffinformal, m

beddiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          7       36.84       36.84
          1 |         12       63.16      100.00
------------+-----------------------------------
      Total |         19      100.00

. tab beddiffinformal[iweight=r13wtrespe], m

beddiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     24,589       33.17       33.17
          1 |     49,531       66.83      100.00
------------+-----------------------------------
      Total |     74,120      100.00

. restore

. 
. **************************************************************
. *\ Mobility
. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having mobility diff
. tablist walkdiff beddiff

  +----------------------------------------------------------+
  | walkdiff   beddiff   _Freq_   _Perc_   _CFreq_   _CPerc_ |
  |----------------------------------------------------------|
  |        0         0      142    76.34       142     76.34 |
  |        1         0       24    12.90       166     89.25 |
  |        1         1       12     6.45       178     95.70 |
  |        0         1        7     3.76       185     99.46 |
  |       99         0        1     0.54       186    100.00 |
  +----------------------------------------------------------+

. gen mobilitydiff = 99

. replace mobilitydiff = 1 if walkdiff ==1 | beddiff ==1
(43 real changes made)

. replace mobilitydiff = 0 if walkdiff ==0 & beddiff ==0
(142 real changes made)

. tab mobilitydiff, m

mobilitydif |
          f |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        142       76.34       76.34
          1 |         43       23.12       99.46
         99 |          1        0.54      100.00
------------+-----------------------------------
      Total |        186      100.00

. *2. % of people who need mobility help
. tab mobilitydiff,m

mobilitydif |
          f |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        142       76.34       76.34
          1 |         43       23.12       99.46
         99 |          1        0.54      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab mobilitydiff[iweight=r13wtrespe],m

mobilitydif |
          f |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    660,577       76.30       76.30
          1 |    199,990       23.10       99.40
         99 |      5,153        0.60      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. *3. Identify people having mobility diff received informal help
. gen mobilityiffinformal = 0

. replace mobilityiffinformal = 1 if mobilitydiff ==1 & Informal ==1
(26 real changes made)

. replace mobilityiffinformal = 99 if mobilitydiff ==99
(1 real change made)

. tab mobilityiffinformal, m

mobilityiff |
   informal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        159       85.48       85.48
          1 |         26       13.98       99.46
         99 |          1        0.54      100.00
------------+-----------------------------------
      Total |        186      100.00

. *4. % of people who need help and received informal help
. tab mobilityiffinformal, m

mobilityiff |
   informal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        159       85.48       85.48
          1 |         26       13.98       99.46
         99 |          1        0.54      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab mobilityiffinformal[iweight=r13wtrespe], m

mobilityiff |
   informal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    737,191       85.15       85.15
          1 |    123,376       14.25       99.40
         99 |      5,153        0.60      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if mobilitydiff ==1
(143 observations deleted)

. tab mobilityiffinformal, m

mobilityiff |
   informal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         17       39.53       39.53
          1 |         26       60.47      100.00
------------+-----------------------------------
      Total |         43      100.00

. tab mobilityiffinformal[iweight=r13wtrespe], m

mobilityiff |
   informal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     76,614       38.31       38.31
          1 |    123,376       61.69      100.00
------------+-----------------------------------
      Total |    199,990      100.00

. restore

. 
. 
. **************************************************************
. **************************************************************
. **************************************************************
. *\ Self-Care
. *\ Diff-Eat 
. tab r13eat, m nolab

 r13eat:w13 |
          r |
diff-eating |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        169       90.86       90.86
          1 |         15        8.06       98.92
          9 |          2        1.08      100.00
------------+-----------------------------------
      Total |        186      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff
. gen eatdiff = 99

. replace eatdiff = 1 if inlist(r13eat,1,2,9)
(17 real changes made)

. replace eatdiff = 0 if r13eat ==0
(169 real changes made)

. tab eatdiff, m

    eatdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        169       90.86       90.86
          1 |         17        9.14      100.00
------------+-----------------------------------
      Total |        186      100.00

. *2. % of people who need help
. tab eatdiff,m

    eatdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        169       90.86       90.86
          1 |         17        9.14      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab eatdiff[iweight=r13wtrespe],m

    eatdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    799,969       92.41       92.41
          1 |     65,751        7.59      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. *3. Identify people having diff received informal help
. gen eatdiffinformal = 0

. replace eatdiffinformal = 1 if eatdiff ==1 & Informal ==1
(14 real changes made)

. replace eatdiffinformal = 99 if eatdiff ==99
(0 real changes made)

. tab eatdiffinformal, m

eatdiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        172       92.47       92.47
          1 |         14        7.53      100.00
------------+-----------------------------------
      Total |        186      100.00

. *4. % of people who need help and received informal help
. tab eatdiffinformal, m

eatdiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        172       92.47       92.47
          1 |         14        7.53      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab eatdiffinformal[iweight=r13wtrespe], m

eatdiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    815,773       94.23       94.23
          1 |     49,947        5.77      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if eatdiff ==1
(169 observations deleted)

. tab eatdiffinformal, m

eatdiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          3       17.65       17.65
          1 |         14       82.35      100.00
------------+-----------------------------------
      Total |         17      100.00

. tab eatdiffinformal[iweight=r13wtrespe], m

eatdiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     15,804       24.04       24.04
          1 |     49,947       75.96      100.00
------------+-----------------------------------
      Total |     65,751      100.00

. restore

. 
. **************************************************************
. *\ Diff-Bath
. tab r13bath, m nolab

r13bath:w13 |
          r |
diff-bathin |
       g or |
   showerng |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        147       79.03       79.03
          1 |         36       19.35       98.39
          2 |          2        1.08       99.46
         .d |          1        0.54      100.00
------------+-----------------------------------
      Total |        186      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having bath diff
. gen bathdiff = 99

. replace bathdiff = 1 if inlist(r13bath,1,2,9)
(38 real changes made)

. replace bathdiff = 0 if r13bath ==0
(147 real changes made)

. tab bathdiff, m

   bathdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        147       79.03       79.03
          1 |         38       20.43       99.46
         99 |          1        0.54      100.00
------------+-----------------------------------
      Total |        186      100.00

. *2. % of people who need help
. tab bathdiff,m

   bathdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        147       79.03       79.03
          1 |         38       20.43       99.46
         99 |          1        0.54      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab bathdiff[iweight=r13wtrespe],m

   bathdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    687,432       79.41       79.41
          1 |    173,135       20.00       99.40
         99 |      5,153        0.60      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. *3. Identify people having diff received informal help
. gen bathdiffinformal = 0

. replace bathdiffinformal = 1 if bathdiff ==1 & Informal ==1
(27 real changes made)

. replace bathdiffinformal = 99 if bathdiff ==99
(1 real change made)

. tab bathdiffinformal, m

bathdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        158       84.95       84.95
          1 |         27       14.52       99.46
         99 |          1        0.54      100.00
------------+-----------------------------------
      Total |        186      100.00

. *4. % of people who need help and received informal help
. tab bathdiffinformal, m

bathdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        158       84.95       84.95
          1 |         27       14.52       99.46
         99 |          1        0.54      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab bathdiffinformal[iweight=r13wtrespe], m

bathdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    744,317       85.98       85.98
          1 |    116,250       13.43       99.40
         99 |      5,153        0.60      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if bathdiff ==1
(148 observations deleted)

. tab bathdiffinformal, m

bathdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         11       28.95       28.95
          1 |         27       71.05      100.00
------------+-----------------------------------
      Total |         38      100.00

. tab bathdiffinformal[iweight=r13wtrespe], m

bathdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     56,885       32.86       32.86
          1 |    116,250       67.14      100.00
------------+-----------------------------------
      Total |    173,135      100.00

. restore

. 
. **************************************************************
. *\ Diff-Toilt
. tab r13toilt, m nolab

r13toilt:w1 |
        3 r |
 diff-using |
 the toilet |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        164       88.17       88.17
          1 |         21       11.29       99.46
          2 |          1        0.54      100.00
------------+-----------------------------------
      Total |        186      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff
. gen toiltdiff = 99

. replace toiltdiff = 1 if inlist(r13toilt,1,2,9)
(22 real changes made)

. replace toiltdiff = 0 if r13toilt ==0
(164 real changes made)

. tab toiltdiff, m

  toiltdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        164       88.17       88.17
          1 |         22       11.83      100.00
------------+-----------------------------------
      Total |        186      100.00

. *2. % of people who need help
. tab toiltdiff,m

  toiltdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        164       88.17       88.17
          1 |         22       11.83      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab toiltdiff[iweight=r13wtrespe],m

  toiltdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    776,836       89.73       89.73
          1 |     88,884       10.27      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. *3. Identify people having diff received informal help
. gen toiltdiffinformal = 0

. replace toiltdiffinformal = 1 if toiltdiff ==1 & Informal ==1
(13 real changes made)

. replace toiltdiffinformal = 99 if toiltdiff ==99
(0 real changes made)

. tab toiltdiffinformal, m

toiltdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        173       93.01       93.01
          1 |         13        6.99      100.00
------------+-----------------------------------
      Total |        186      100.00

. *4. % of people who need help and received informal help
. tab toiltdiffinformal, m

toiltdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        173       93.01       93.01
          1 |         13        6.99      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab toiltdiffinformal[iweight=r13wtrespe], m

toiltdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    814,709       94.11       94.11
          1 |     51,011        5.89      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if toiltdiff ==1
(164 observations deleted)

. tab toiltdiffinformal, m

toiltdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          9       40.91       40.91
          1 |         13       59.09      100.00
------------+-----------------------------------
      Total |         22      100.00

. tab toiltdiffinformal[iweight=r13wtrespe], m

toiltdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     37,873       42.61       42.61
          1 |     51,011       57.39      100.00
------------+-----------------------------------
      Total |     88,884      100.00

. restore

. 
. **************************************************************
. *\ Diff-Dress
. tab r13dress, m nolab

r13dress:w1 |
        3 r |
diff-dressi |
         ng |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        156       83.87       83.87
          1 |         29       15.59       99.46
          2 |          1        0.54      100.00
------------+-----------------------------------
      Total |        186      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff
. gen dressdiff = 99

. replace dressdiff = 1 if inlist(r13dress,1,2,9)
(30 real changes made)

. replace dressdiff = 0 if r13dress ==0
(156 real changes made)

. tab dressdiff, m

  dressdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        156       83.87       83.87
          1 |         30       16.13      100.00
------------+-----------------------------------
      Total |        186      100.00

. *2. % of people who need help
. tab dressdiff,m

  dressdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        156       83.87       83.87
          1 |         30       16.13      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab dressdiff[iweight=r13wtrespe],m

  dressdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    758,231       87.58       87.58
          1 |    107,489       12.42      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. *3. Identify people having diff received informal help
. gen dressdiffinformal = 0

. replace dressdiffinformal = 1 if dressdiff ==1 & Informal ==1
(20 real changes made)

. replace dressdiffinformal = 99 if dressdiff ==99
(0 real changes made)

. tab dressdiffinformal, m

dressdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        166       89.25       89.25
          1 |         20       10.75      100.00
------------+-----------------------------------
      Total |        186      100.00

. *4. % of people who need help and received informal help
. tab dressdiffinformal, m

dressdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        166       89.25       89.25
          1 |         20       10.75      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab dressdiffinformal[iweight=r13wtrespe], m

dressdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    794,326       91.75       91.75
          1 |     71,394        8.25      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if dressdiff ==1
(156 observations deleted)

. tab dressdiffinformal, m

dressdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         10       33.33       33.33
          1 |         20       66.67      100.00
------------+-----------------------------------
      Total |         30      100.00

. tab dressdiffinformal[iweight=r13wtrespe], m

dressdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     36,095       33.58       33.58
          1 |     71,394       66.42      100.00
------------+-----------------------------------
      Total |    107,489      100.00

. restore

. 
. **************************************************************
. *\ SELF-CARE
. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having self-care diff
. tablist eatdiff bathdiff toiltdiff dressdiff

  +--------------------------------------------------------------------------------+
  | eatdiff   bathdiff   toiltd~f   dressd~f   _Freq_   _Perc_   _CFreq_   _CPerc_ |
  |--------------------------------------------------------------------------------|
  |       0          0          0          0      126    67.74       126     67.74 |
  |       0          1          0          0       14     7.53       140     75.27 |
  |       0          0          0          1        8     4.30       148     79.57 |
  |       1          1          1          1        6     3.23       154     82.80 |
  |       0          1          1          0        5     2.69       159     85.48 |
  |--------------------------------------------------------------------------------|
  |       0          1          1          1        5     2.69       164     88.17 |
  |       1          0          0          0        4     2.15       168     90.32 |
  |       0          1          0          1        4     2.15       172     92.47 |
  |       1          0          0          1        3     1.61       175     94.09 |
  |       1          1          0          0        3     1.61       178     95.70 |
  |--------------------------------------------------------------------------------|
  |       0          0          1          1        3     1.61       181     97.31 |
  |       0          0          1          0        3     1.61       184     98.92 |
  |       0         99          0          0        1     0.54       185     99.46 |
  |       1          1          0          1        1     0.54       186    100.00 |
  +--------------------------------------------------------------------------------+

. gen selfcarediff = 99

. replace selfcarediff = 1 if eatdiff ==1 | bathdiff ==1 | toiltdiff==1 | dressdiff==1
(59 real changes made)

. replace selfcarediff = 0 if eatdiff ==0 & bathdiff ==0 & toiltdiff==0 & dressdiff==0
(126 real changes made)

. tab selfcarediff, m

selfcaredif |
          f |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        126       67.74       67.74
          1 |         59       31.72       99.46
         99 |          1        0.54      100.00
------------+-----------------------------------
      Total |        186      100.00

. *2. % of people who need self-care help
. tab selfcarediff,m

selfcaredif |
          f |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        126       67.74       67.74
          1 |         59       31.72       99.46
         99 |          1        0.54      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab selfcarediff[iweight=r13wtrespe],m

selfcaredif |
          f |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    608,925       70.34       70.34
          1 |    251,642       29.07       99.40
         99 |      5,153        0.60      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. *3. Identify people having self-care diff received informal help
. gen selfcarediffinformal = 0

. replace selfcarediffinformal = 1 if selfcarediff ==1 & Informal ==1
(38 real changes made)

. replace selfcarediffinformal = 99 if selfcarediff ==99
(1 real change made)

. tab selfcarediffinformal, m

selfcaredif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        147       79.03       79.03
          1 |         38       20.43       99.46
         99 |          1        0.54      100.00
------------+-----------------------------------
      Total |        186      100.00

. *4. % of people who need help and received informal help
. tab selfcarediffinformal, m

selfcaredif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        147       79.03       79.03
          1 |         38       20.43       99.46
         99 |          1        0.54      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab selfcarediffinformal[iweight=r13wtrespe], m

selfcaredif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    704,328       81.36       81.36
          1 |    156,239       18.05       99.40
         99 |      5,153        0.60      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if selfcarediff ==1
(127 observations deleted)

. tab selfcarediffinformal, m

selfcaredif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         21       35.59       35.59
          1 |         38       64.41      100.00
------------+-----------------------------------
      Total |         59      100.00

. tab selfcarediffinformal[iweight=r13wtrespe], m

selfcaredif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     95,403       37.91       37.91
          1 |    156,239       62.09      100.00
------------+-----------------------------------
      Total |    251,642      100.00

. restore

. 
. **************************************************************
. **************************************************************
. **************************************************************
. *\ Household Acticity
. *\ Diff-Shop
. tab r13shop, m nolab

r13shop:w13 |
r diff-shop |
        for |
  groceries |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        118       63.44       63.44
          1 |         27       14.52       77.96
          2 |         22       11.83       89.78
          9 |         19       10.22      100.00
------------+-----------------------------------
      Total |        186      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff
. gen shopdiff = 99

. replace shopdiff = 1 if inlist(r13shop,1,2,9)
(68 real changes made)

. replace shopdiff = 0 if r13shop ==0
(118 real changes made)

. tab shopdiff, m

   shopdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        118       63.44       63.44
          1 |         68       36.56      100.00
------------+-----------------------------------
      Total |        186      100.00

. *2. % of people who need help
. tab shopdiff,m

   shopdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        118       63.44       63.44
          1 |         68       36.56      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab shopdiff[iweight=r13wtrespe],m

   shopdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    547,763       63.27       63.27
          1 |    317,957       36.73      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. *3. Identify people having diff received informal help
. gen shopdiffinformal = 0

. replace shopdiffinformal = 1 if shopdiff ==1 & Informal ==1
(51 real changes made)

. replace shopdiffinformal = 99 if shopdiff ==99
(0 real changes made)

. tab shopdiffinformal, m

shopdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        135       72.58       72.58
          1 |         51       27.42      100.00
------------+-----------------------------------
      Total |        186      100.00

. *4. % of people who need help and received informal help
. tab shopdiffinformal, m

shopdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        135       72.58       72.58
          1 |         51       27.42      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab shopdiffinformal[iweight=r13wtrespe], m

shopdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    639,493       73.87       73.87
          1 |    226,227       26.13      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if shopdiff ==1
(118 observations deleted)

. tab shopdiffinformal, m

shopdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         17       25.00       25.00
          1 |         51       75.00      100.00
------------+-----------------------------------
      Total |         68      100.00

. tab shopdiffinformal[iweight=r13wtrespe], m

shopdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     91,730       28.85       28.85
          1 |    226,227       71.15      100.00
------------+-----------------------------------
      Total |    317,957      100.00

. restore

. 
. 
. **************************************************************
. *\ Diff-Hotmeal
. tab r13meals, m nolab

r13meals:w1 |
        3 r |
diff-prepar |
    ing hot |
      meals |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        118       63.44       63.44
          1 |         23       12.37       75.81
          2 |         18        9.68       85.48
          9 |         27       14.52      100.00
------------+-----------------------------------
      Total |        186      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having meal diff
. gen mealdiff = 99

. replace mealdiff = 1 if inlist(r13meals,1,2,9)
(68 real changes made)

. replace mealdiff = 0 if r13meals ==0
(118 real changes made)

. tab mealdiff, m

   mealdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        118       63.44       63.44
          1 |         68       36.56      100.00
------------+-----------------------------------
      Total |        186      100.00

. *2. % of people who need help
. tab mealdiff,m

   mealdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        118       63.44       63.44
          1 |         68       36.56      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab mealdiff[iweight=r13wtrespe],m

   mealdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    536,549       61.98       61.98
          1 |    329,171       38.02      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. *3. Identify people having meal diff received informal help
. gen mealdiffinformal = 0

. replace mealdiffinformal = 1 if mealdiff ==1 & Informal ==1
(42 real changes made)

. replace mealdiffinformal = 99 if mealdiff ==99
(0 real changes made)

. tab mealdiffinformal, m

mealdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        144       77.42       77.42
          1 |         42       22.58      100.00
------------+-----------------------------------
      Total |        186      100.00

. *4. % of people who need help and received informal help
. tab mealdiffinformal, m

mealdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        144       77.42       77.42
          1 |         42       22.58      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab mealdiffinformal[iweight=r13wtrespe], m

mealdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    665,704       76.90       76.90
          1 |    200,016       23.10      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if mealdiff ==1
(118 observations deleted)

. tab mealdiffinformal, m

mealdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         26       38.24       38.24
          1 |         42       61.76      100.00
------------+-----------------------------------
      Total |         68      100.00

. tab mealdiffinformal[iweight=r13wtrespe], m

mealdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    129,155       39.24       39.24
          1 |    200,016       60.76      100.00
------------+-----------------------------------
      Total |    329,171      100.00

. restore

. 
. **************************************************************
. *\ Diff-Handle Money
. tab r13money, m nolab

r13money:w1 |
        3 r |
diff-managi |
   ng money |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        132       70.97       70.97
          1 |         27       14.52       85.48
          2 |         17        9.14       94.62
          9 |         10        5.38      100.00
------------+-----------------------------------
      Total |        186      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff
. gen moneydiff = 99

. replace moneydiff = 1 if inlist(r13money,1,2,9)
(54 real changes made)

. replace moneydiff = 0 if r13money ==0
(132 real changes made)

. tab moneydiff, m

  moneydiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        132       70.97       70.97
          1 |         54       29.03      100.00
------------+-----------------------------------
      Total |        186      100.00

. *2. % of people who need help
. tab moneydiff,m

  moneydiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        132       70.97       70.97
          1 |         54       29.03      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab moneydiff[iweight=r13wtrespe],m

  moneydiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    619,237       71.53       71.53
          1 |    246,483       28.47      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. *3. Identify people having diff received informal help
. gen moneydiffinformal = 0

. replace moneydiffinformal = 1 if moneydiff ==1 & Informal ==1
(44 real changes made)

. replace moneydiffinformal = 99 if moneydiff ==99
(0 real changes made)

. tab moneydiffinformal, m

moneydiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        142       76.34       76.34
          1 |         44       23.66      100.00
------------+-----------------------------------
      Total |        186      100.00

. *4. % of people who need help and received informal help
. tab moneydiffinformal, m

moneydiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        142       76.34       76.34
          1 |         44       23.66      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab moneydiffinformal[iweight=r13wtrespe], m

moneydiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    663,253       76.61       76.61
          1 |    202,467       23.39      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if moneydiff ==1
(132 observations deleted)

. tab moneydiffinformal, m

moneydiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         10       18.52       18.52
          1 |         44       81.48      100.00
------------+-----------------------------------
      Total |         54      100.00

. tab moneydiffinformal[iweight=r13wtrespe], m

moneydiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     44,016       17.86       17.86
          1 |    202,467       82.14      100.00
------------+-----------------------------------
      Total |    246,483      100.00

. restore

. 
. 
. **************************************************************
. *\ Diff-Phone Call
. tab r13phone, m nolab

r13phone:w1 |
        3 r |
   diff-use |
  telephone |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        161       86.56       86.56
          1 |         17        9.14       95.70
          2 |          5        2.69       98.39
          9 |          3        1.61      100.00
------------+-----------------------------------
      Total |        186      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff making phone call
. gen phoncalldiff = 99

. replace phoncalldiff = 1 if inlist(r13phone,1,2,9)
(25 real changes made)

. replace phoncalldiff = 0 if r13phone ==0
(161 real changes made)

. tab phoncalldiff, m

phoncalldif |
          f |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        161       86.56       86.56
          1 |         25       13.44      100.00
------------+-----------------------------------
      Total |        186      100.00

. *2. % of people who need help
. tab phoncalldiff,m

phoncalldif |
          f |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        161       86.56       86.56
          1 |         25       13.44      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab phoncalldiff[iweight=r13wtrespe],m

phoncalldif |
          f |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    754,363       87.14       87.14
          1 |    111,357       12.86      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. *3. Identify people having diff received informal help
. gen phoncalldiffinformal = 0

. replace phoncalldiffinformal = 1 if phoncalldiff ==1 & Informal ==1
(20 real changes made)

. replace phoncalldiffinformal = 99 if phoncalldiff ==99
(0 real changes made)

. tab phoncalldiffinformal, m

phoncalldif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        166       89.25       89.25
          1 |         20       10.75      100.00
------------+-----------------------------------
      Total |        186      100.00

. *4. % of people who need help and received informal help
. tab phoncalldiffinformal, m

phoncalldif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        166       89.25       89.25
          1 |         20       10.75      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab phoncalldiffinformal[iweight=r13wtrespe], m

phoncalldif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    774,100       89.42       89.42
          1 |     91,620       10.58      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if phoncalldiff ==1
(161 observations deleted)

. tab phoncalldiffinformal, m

phoncalldif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          5       20.00       20.00
          1 |         20       80.00      100.00
------------+-----------------------------------
      Total |         25      100.00

. tab phoncalldiffinformal[iweight=r13wtrespe], m

phoncalldif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |     19,737       17.72       17.72
          1 |     91,620       82.28      100.00
------------+-----------------------------------
      Total |    111,357      100.00

. restore

. 
. **************************************************************
. *\ HOUSEHOLD ACTIVITY
. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff doing household acticities
. tablist shopdiff mealdiff moneydiff phoncalldiff

  +---------------------------------------------------------------------------------+
  | shopdiff   mealdiff   moneyd~f   phonca~f   _Freq_   _Perc_   _CFreq_   _CPerc_ |
  |---------------------------------------------------------------------------------|
  |        0          0          0          0       91    48.92        91     48.92 |
  |        1          1          1          0       18     9.68       109     58.60 |
  |        1          1          1          1       18     9.68       127     68.28 |
  |        1          1          0          0       13     6.99       140     75.27 |
  |        0          1          0          0       12     6.45       152     81.72 |
  |---------------------------------------------------------------------------------|
  |        1          0          0          0       11     5.91       163     87.63 |
  |        0          0          1          0        7     3.76       170     91.40 |
  |        1          0          1          0        5     2.69       175     94.09 |
  |        0          1          1          0        4     2.15       179     96.24 |
  |        0          0          0          1        3     1.61       182     97.85 |
  |---------------------------------------------------------------------------------|
  |        1          1          0          1        2     1.08       184     98.92 |
  |        0          1          1          1        1     0.54       185     99.46 |
  |        1          0          1          1        1     0.54       186    100.00 |
  +---------------------------------------------------------------------------------+

. gen householddiff = 99

. replace householddiff = 1 if shopdiff ==1 | mealdiff ==1 | moneydiff==1 | phoncalldiff==1
(95 real changes made)

. replace householddiff = 0 if shopdiff ==0 & mealdiff ==0 & moneydiff==0 & phoncalldiff==0
(91 real changes made)

. tab householddiff, m

householddi |
         ff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         91       48.92       48.92
          1 |         95       51.08      100.00
------------+-----------------------------------
      Total |        186      100.00

. *2. % of people who need household help
. tab householddiff,m

householddi |
         ff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         91       48.92       48.92
          1 |         95       51.08      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab householddiff[iweight=r13wtrespe],m

householddi |
         ff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    434,944       50.24       50.24
          1 |    430,776       49.76      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. *3. Identify people having household diff received informal help
. gen householddiffinformal = 0

. replace householddiffinformal = 1 if householddiff ==1 & Informal ==1
(59 real changes made)

. replace householddiffinformal = 99 if householddiff ==99
(0 real changes made)

. tab householddiffinformal, m

householddi |
 ffinformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        127       68.28       68.28
          1 |         59       31.72      100.00
------------+-----------------------------------
      Total |        186      100.00

. *4. % of people who need help and received informal help
. tab householddiffinformal, m

householddi |
 ffinformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        127       68.28       68.28
          1 |         59       31.72      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab householddiffinformal[iweight=r13wtrespe], m

householddi |
 ffinformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    606,306       70.03       70.03
          1 |    259,414       29.97      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if householddiff ==1
(91 observations deleted)

. tab householddiffinformal, m

householddi |
 ffinformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         36       37.89       37.89
          1 |         59       62.11      100.00
------------+-----------------------------------
      Total |         95      100.00

. tab householddiffinformal[iweight=r13wtrespe], m

householddi |
 ffinformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    171,362       39.78       39.78
          1 |    259,414       60.22      100.00
------------+-----------------------------------
      Total |    430,776      100.00

. restore

. 
. 
. **************************************************************
. **************************************************************
. **************************************************************
. *\ Medicare
. tab r13meds, m nolab

r13meds:w13 |
r diff-take |
medications |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        168       90.32       90.32
          1 |         18        9.68      100.00
------------+-----------------------------------
      Total |        186      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff taking madications
. gen medsdiff = 99

. replace medsdiff = 1 if inlist(r13meds,1,2,9)
(18 real changes made)

. replace medsdiff = 0 if r13meds ==0
(168 real changes made)

. tab medsdiff, m

   medsdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        168       90.32       90.32
          1 |         18        9.68      100.00
------------+-----------------------------------
      Total |        186      100.00

. *2. % of people who need help
. tab medsdiff,m

   medsdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        168       90.32       90.32
          1 |         18        9.68      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab medsdiff[iweight=r13wtrespe],m

   medsdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    793,359       91.64       91.64
          1 |     72,361        8.36      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. *3. Identify people having diff received informal help
. gen medsdiffinformal = 0

. replace medsdiffinformal = 1 if medsdiff ==1 & Informal ==1
(17 real changes made)

. replace medsdiffinformal = 99 if medsdiff ==99
(0 real changes made)

. tab medsdiffinformal, m

medsdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        169       90.86       90.86
          1 |         17        9.14      100.00
------------+-----------------------------------
      Total |        186      100.00

. *4. % of people who need help and received informal help
. tab medsdiffinformal, m

medsdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        169       90.86       90.86
          1 |         17        9.14      100.00
------------+-----------------------------------
      Total |        186      100.00

. tab medsdiffinformal[iweight=r13wtrespe], m

medsdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |    798,378       92.22       92.22
          1 |     67,342        7.78      100.00
------------+-----------------------------------
      Total |    865,720      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if medsdiff ==1
(168 observations deleted)

. tab medsdiffinformal, m

medsdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          1        5.56        5.56
          1 |         17       94.44      100.00
------------+-----------------------------------
      Total |         18      100.00

. tab medsdiffinformal[iweight=r13wtrespe], m

medsdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      5,019        6.94        6.94
          1 |     67,342       93.06      100.00
------------+-----------------------------------
      Total |     72,361      100.00

. restore

. 
. 
. capture log close
