-------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/Sophia/Desktop/Research/Norma/ICinLTC/log/Table2_communitydwelling.log
  log type:  text
 opened on:  10 Dec 2021, 09:35:00

. 
. *\ Import datasets- 2016 Biennial and Longitudinal
. *1. Read in the 2016 Rand Biennial Data and select five variables
. use ph115 ph124 ph130 ph004 hhidpn using "$data/h16f2a.dta", clear

. tempfile 2016biennial

. save `2016biennial'
file /var/folders/0c/cmyfzq7x4zsbb_8fq5ly69ch0000gn/T//S_01662.000001 saved as .dta format

. *2. Read Rand HRS Longitudinal File 2016 and subset to only include wave13
. use inw13 r13agey_e r13nhmliv r13walkr r13dress r13bath r13eat r13bed r13toilt ///
> r13phone r13money r13meds r13shop r13meals hhidpn r13wtrespe using "$data/randhrs1992_2016v2.dta",cle
> ar

. keep if inw13==1
(21,140 observations deleted)

. tempfile 2016longitudinal

. save `2016longitudinal'
file /var/folders/0c/cmyfzq7x4zsbb_8fq5ly69ch0000gn/T//S_01662.000002 saved as .dta format

. *3. Merge two datasets
. use `2016longitudinal', clear

. merge 1:1 hhidpn using `2016biennial',gen (merge_1)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            20,912  (merge_1==3)
    -----------------------------------------

. distinct hhidpn //20,912

-------------------------------
        |     total   distinct
--------+----------------------
 hhidpn |     20912      20912
-------------------------------

. *4. Sample restriction
. keep if r13agey_e>=65
(10,918 observations deleted)

. 
. *\ Generate Vars
. *1. Rename vars
. *** Rename PH115 (Group Meals) as Meals 
. tab ph115, m nolab 

group meals |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        240        2.40        2.40
          3 |          2        0.02        2.42
          4 |          7        0.07        2.49
          5 |        325        3.25        5.74
          8 |          4        0.04        5.78
          . |      9,416       94.22      100.00
------------+-----------------------------------
      Total |      9,994      100.00

. rename ph115 Meals

. *** Rename PH124 as ADLHELP
. tab ph124, m nolab 

bathing-dre |
ssing-eatin |
          g |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        153        1.53        1.53
          5 |        406        4.06        5.59
          8 |         10        0.10        5.69
          . |      9,425       94.31      100.00
------------+-----------------------------------
      Total |      9,994      100.00

. rename ph124 ADLHELP 

. *** Rename PH130 as NURSINGHELP
. tab ph130, m nolab 

    nursing |
       care |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        165        1.65        1.65
          5 |        398        3.98        5.63
          8 |          5        0.05        5.68
          9 |          1        0.01        5.69
          . |      9,425       94.31      100.00
------------+-----------------------------------
      Total |      9,994      100.00

. rename ph130 NURSINGHELP

. *** Rename PH004 as LTCRENT
. tab ph004, m nolab 

   own-rent |
       home |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      6,943       69.47       69.47
          2 |      1,624       16.25       85.72
          3 |        394        3.94       89.66
          7 |         61        0.61       90.27
          8 |          6        0.06       90.33
          9 |          9        0.09       90.42
          . |        957        9.58      100.00
------------+-----------------------------------
      Total |      9,994      100.00

. rename ph004 LTCRENT

. 
. *2. Formal Rensidential LTC Care
. *** Independent Living = Meals Yes, ADL HELP No, Nursing No, RENT Yes;
. gen IL = 0

. replace IL = 1 if Meals ==1 & ADLHELP ==5 & NURSINGHELP ==5 & LTCRENT ==2
(53 real changes made)

. tab IL, m 

         IL |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,941       99.47       99.47
          1 |         53        0.53      100.00
------------+-----------------------------------
      Total |      9,994      100.00

. *** Assisted Living = Meals Yes, ADL HELP Yes, Nursing No, RENT Yes;
. gen AL = 0

. replace AL = 1 if Meals ==1 & ADLHELP == 1 & NURSINGHELP ==5 & LTCRENT == 2
(22 real changes made)

. tab AL, m

         AL |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,972       99.78       99.78
          1 |         22        0.22      100.00
------------+-----------------------------------
      Total |      9,994      100.00

. *** Continuing Care Retirement Community = Meals Yes, ADL HELP Yes, Nursing Yes, RENT or Own 
. gen CCRC = 0 

. replace CCRC = 1 if Meals ==1 & ADLHELP ==1 & NURSINGHELP ==1
(111 real changes made)

. tab CCRC,m 

       CCRC |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,883       98.89       98.89
          1 |        111        1.11      100.00
------------+-----------------------------------
      Total |      9,994      100.00

. *** Combine three above because frequencies are so low for them separately
. gen FC_COMBO = 0

. replace FC_COMBO = 1 if CCRC ==1 | AL ==1 | IL ==1 
(186 real changes made)

. *** Save as a tempfile
. tempfile hrs2016

. save `hrs2016'
file /var/folders/0c/cmyfzq7x4zsbb_8fq5ly69ch0000gn/T//S_01662.000003 saved as .dta format

. 
. *\ Identify people who are currently living in a care facility
. keep if FC_COMBO ==1
(9,808 observations deleted)

. tab FC_COMBO, m //186 observations remain

   FC_COMBO |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        186      100.00      100.00
------------+-----------------------------------
      Total |        186      100.00

. *** Save as a tempfile
. tempfile rensidentialfacility

. save `rensidentialfacility'
file /var/folders/0c/cmyfzq7x4zsbb_8fq5ly69ch0000gn/T//S_01662.000004 saved as .dta format

. 
. *\ Identify people who are currently living in a nursing home
. use `hrs2016', clear

. tab r13nhmliv CCRC, m

r13nhmliv: |
  w13 live |
   in nurs |
   home at |         CCRC
     iview |         0          1 |     Total
-----------+----------------------+----------
      0.no |     9,487        100 |     9,587 
     1.yes |       396         11 |       407 
-----------+----------------------+----------
     Total |     9,883        111 |     9,994 

. keep if r13nhmliv == 1 & CCRC!=1 & FC_COMBO==0
(9,598 observations deleted)

. tab r13nhmliv CCRC, m //396 obs remain.

r13nhmliv: |
  w13 live |
   in nurs |
   home at |    CCRC
     iview |         0 |     Total
-----------+-----------+----------
     1.yes |       396 |       396 
-----------+-----------+----------
     Total |       396 |       396 

. *** Save as a tempfile
. tempfile nursinghome

. save `nursinghome'
file /var/folders/0c/cmyfzq7x4zsbb_8fq5ly69ch0000gn/T//S_01662.000005 saved as .dta format

. 
. *\ Identify people who are community-dwelling
. use `hrs2016', clear

. gen nursinghome = 0

. replace nursinghome = 1 if r13nhmliv == 1 & CCRC!=1 & FC_COMBO==0
(396 real changes made)

. tab nursinghome, m

nursinghome |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,598       96.04       96.04
          1 |        396        3.96      100.00
------------+-----------------------------------
      Total |      9,994      100.00

. drop if FC_COMBO==1
(186 observations deleted)

. drop if nursinghome ==1 
(396 observations deleted)

. distinct hhidpn

-------------------------------
        |     total   distinct
--------+----------------------
 hhidpn |      9412       9412
-------------------------------

. *** Save as a tempfile
. tempfile communitydwelling

. save `communitydwelling'
file /var/folders/0c/cmyfzq7x4zsbb_8fq5ly69ch0000gn/T//S_01662.000006 saved as .dta format

. 
. clear all

. *\ Import dataset- HRS 2016 core helper file
. infile using "$data/H16G_HP.dct", using("$data/H16G_HP.da")

dictionary using c:\hrs2016\data\H16G_HP.da {
* Note: change location of input file to match your situation.
 _column(1) str6 HHID %6s "HOUSEHOLD IDENTIFICATION NUMBER"
 _column(7) str3 PN %3s "RESPONDENT PERSON IDENTIFICATION NUMBER"
 _column(10) str1 PSUBHH %1s "2016 SUB HOUSEHOLD IDENTIFICATION NUMBER"
 _column(11) str1 OSUBHH %1s "2014 SUB HOUSEHOLD IDENTIFICATION NUMBER"
 _column(12) str3 PPN_SP %3s "2016 SPOUSE/PARTNER PERSON NUMBER"
 _column(15) byte PCSR %1.0f "2016 WHETHER COVERSHEET RESPONDENT"
 _column(16) byte PFAMR %1.0f "2016 WHETHER FAMILY RESPONDENT"
 _column(17) byte PFINR %1.0f "2016 WHETHER FINANCIAL RESPONDENT"
 _column(18) str3 OPN %3s "OTHER PERSON NUMBER"
 _column(21) byte PG069 %2.0f "HELPER RELATIONSHIP"
 _column(23) int PG066 %3.0f "WHO HELPED LOOP"
 _column(26) byte PADLNDX %1.0f "INDEX CONNECTION TO THE ADL TABLE"
 _column(27) byte PIADLNDX %1.0f "INDEX CONNECTION TO THE IADL TABLE"
 _column(28) byte PMNYNDX %1.0f "INDEX CONNECTION TO THE MONEY TABLE"
 _column(29) byte PG070 %2.0f "FREQ OF HELP GIVEN"
 _column(31) byte PG071 %1.0f "# DAYS HELPER HELPED"
 _column(32) byte PG072 %1.0f "DID HELPER HELP EVERY DY"
 _column(33) byte PG073 %2.0f "#HRS OF HELP"
 _column(35) byte PG074 %1.0f "HELPERS SEX"
 _column(36) str3 PG075 %3s "GRANDCHILD OF WHICH CHILD"
 _column(39) byte PG076 %1.0f "HELPER GIVEN MONEY TO HELP"
 _column(40) byte PG077 %1.0f "DOES INS PAY"
 _column(41) long PG078 %5.0f "AMT R/SP/P PAID"
 _column(46) byte PG079 %1.0f "AMT R/SP/P PAID HELPER"
 _column(47) byte PG080 %1.0f "AMT $100"
 _column(48) byte PG081 %1.0f "OTR FIN HELP"
 _column(49) byte PG082 %1.0f "HELPER=CHLD,REL,OTR"
 _column(50) str3 PG083 %3s "WHICH CHLD"
 _column(53) byte PVDATE %2.0f "2016 DATA MODEL VERSION"
 _column(55) byte PVERSION %1.0f "2016 DATA RELEASE VERSION"
}

(6,239 observations read)

. *1. Gen hhidpn using HHID and PN
. gen hhidpn = HHID+PN

. destring hhidpn, replace
hhidpn: all characters numeric; replaced as long

. *2. Make 6 relationship categories from dozens of options for helper relationships
. gen rel_cat = 0

. replace rel_cat = 1 if inlist(PG069,21,22,23,24,25) //Professional
(882 real changes made)

. replace rel_cat = 2 if inlist(PG069,2,26,27) //Spouse/Partner
(1,388 real changes made)

. replace rel_cat = 3 if inlist(PG069,3,8) //Son/Daughter in Law
(1,011 real changes made)

. replace rel_cat = 4 if inlist(PG069,5,6) //Daughter/Son in law
(1,531 real changes made)

. replace rel_cat = 5 if inlist(PG069,4,7,9,10,11,12,13,14,15,16,17,18,19,28,30,31,33,90,91)
(986 real changes made)

. replace rel_cat = 6 if inlist(PG069,20,32,34,98)
(438 real changes made)

. replace rel_cat = 99 if PG069 == 98 //0 represents self
(0 real changes made)

. tab rel_cat, m

    rel_cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          3        0.05        0.05
          1 |        882       14.14       14.18
          2 |      1,388       22.25       36.43
          3 |      1,011       16.20       52.64
          4 |      1,531       24.54       77.18
          5 |        986       15.80       92.98
          6 |        438        7.02      100.00
------------+-----------------------------------
      Total |      6,239      100.00

. *3. Informal helpers
. gen Informal = 0

. replace Informal = 1 if PG076 == 5 & inlist(rel_cat,1,6,99)
(340 real changes made)

. replace Informal = 1 if inlist(rel_cat,2,3,4,5)
(4,916 real changes made)

. tab Informal,m

   Informal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        983       15.76       15.76
          1 |      5,256       84.24      100.00
------------+-----------------------------------
      Total |      6,239      100.00

. *4. Keep if Informal equals to 1 AND keep unique IDs for merging
. keep if Informal == 1
(983 observations deleted)

. distinct hhidpn //5,256 obs, 3131 distinct obs.

-------------------------------
        |     total   distinct
--------+----------------------
 hhidpn |      5256       3131
-------------------------------

. duplicates r

Duplicates in terms of all variables

--------------------------------------
   Copies | Observations       Surplus
----------+---------------------------
        1 |         5256             0
--------------------------------------

. bys hhidpn: gen dup = cond(_N==1,0,_n)

. tab dup,m

        dup |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,834       34.89       34.89
          1 |      1,297       24.68       59.57
          2 |      1,297       24.68       84.25
          3 |        496        9.44       93.68
          4 |        198        3.77       97.45
          5 |         81        1.54       98.99
          6 |         37        0.70       99.70
          7 |         14        0.27       99.96
          8 |          2        0.04      100.00
------------+-----------------------------------
      Total |      5,256      100.00

. drop if dup>1
(2,125 observations deleted)

. distinct hhidpn //3131 obs, good.

-------------------------------
        |     total   distinct
--------+----------------------
 hhidpn |      3131       3131
-------------------------------

. keep Informal hhidpn

. *5. Save as a temp file
. tempfile helper

. save `helper'
file /var/folders/0c/cmyfzq7x4zsbb_8fq5ly69ch0000gn/T//S_01662.000007 saved as .dta format

. *6. Merge with the Community
. use `communitydwelling',clear

. merge m:1 hhidpn using `helper', gen(merge_2)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         9,287
        from master                     7,784  (merge_2==1)
        from using                      1,503  (merge_2==2)

    Matched                             1,628  (merge_2==3)
    -----------------------------------------

. *7. Drop if merge_2 (unmatched from using)
. drop if merge_2==2
(1,503 observations deleted)

. *8. Save as a temp file
. tempfile FinalData

. save `FinalData'
file /var/folders/0c/cmyfzq7x4zsbb_8fq5ly69ch0000gn/T//S_01662.000008 saved as .dta format

. *9. Informal var: give NA a numeric number 0
. tab Informal, m

   Informal |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,628       17.30       17.30
          . |      7,784       82.70      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. replace Informal = 0 if mi(Informal)
(7,784 real changes made)

. tab Informal, m

   Informal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,784       82.70       82.70
          1 |      1,628       17.30      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. 
. ****************************************************************************************************
. ***Table 2- Total***
. ********************
. *\ Mobility
. *\ Diff-Walk
. tab r13walkr, m nolab

r13walkr:w1 |
        3 r |
  diff-walk |
across room |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,571       91.06       91.06
          1 |        784        8.33       99.39
          2 |         34        0.36       99.76
          9 |          6        0.06       99.82
         .d |          5        0.05       99.87
         .s |         12        0.13      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff
. gen walkdiff = 99

. replace walkdiff = 1 if inlist(r13walkr,1,2,9)
(824 real changes made)

. replace walkdiff = 0 if r13walkr ==0
(8,571 real changes made)

. tab walkdiff, m

   walkdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,571       91.06       91.06
          1 |        824        8.75       99.82
         99 |         17        0.18      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *2. % of people who need help
. tab walkdiff,m

   walkdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,571       91.06       91.06
          1 |        824        8.75       99.82
         99 |         17        0.18      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab walkdiff[aweight=r13wtrespe],m

   walkdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 8,727.3525       92.73       92.73
          1 | 670.456189        7.12       99.85
         99 | 14.1912844        0.15      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *3. Identify people having diff received informal help
. gen walkdiffinformal = 0

. replace walkdiffinformal = 1 if walkdiff ==1 & Informal ==1
(599 real changes made)

. replace walkdiffinformal = 99 if walkdiff ==99
(17 real changes made)

. tab walkdiffinformal, m

walkdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,796       93.46       93.46
          1 |        599        6.36       99.82
         99 |         17        0.18      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *4. % of people who need help and received informal help
. tab walkdiffinformal, m

walkdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,796       93.46       93.46
          1 |        599        6.36       99.82
         99 |         17        0.18      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab walkdiffinformal[aweight=r13wtrespe], m

walkdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 8,930.2026       94.88       94.88
          1 |  467.60607        4.97       99.85
         99 | 14.1912844        0.15      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if walkdiff ==1
(8,588 observations deleted)

. tablist walkdiffinformal Informal, sort(v)

  +-----------------------------------------------------------+
  | walkdi~l   Informal   _Freq_   _Perc_   _CFreq_   _CPerc_ |
  |-----------------------------------------------------------|
  |        0          0      225    27.31       225     27.31 |
  |        1          1      599    72.69       824    100.00 |
  +-----------------------------------------------------------+

. tab walkdiffinformal, m

walkdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        225       27.31       27.31
          1 |        599       72.69      100.00
------------+-----------------------------------
      Total |        824      100.00

. tab walkdiffinformal[aweight=r13wtrespe], m

walkdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 249.305622       30.26       30.26
          1 | 574.694378       69.74      100.00
------------+-----------------------------------
      Total |        824      100.00

. restore

. 
. **************************************************************
. *\ Diff-Bed
. tab r13bed, m nolab

 r13bed:w13 |
 r diff-get |
  in/out of |
        bed |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,731       92.76       92.76
          1 |        637        6.77       99.53
          2 |         11        0.12       99.65
          9 |         16        0.17       99.82
         .d |          4        0.04       99.86
         .r |          1        0.01       99.87
         .s |         12        0.13      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff
. gen beddiff = 99

. replace beddiff = 1 if inlist(r13bed,1,2,9)
(664 real changes made)

. replace beddiff = 0 if r13bed ==0
(8,731 real changes made)

. tab beddiff, m

    beddiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,731       92.76       92.76
          1 |        664        7.05       99.82
         99 |         17        0.18      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *2. % of people who need help
. tab beddiff,m

    beddiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,731       92.76       92.76
          1 |        664        7.05       99.82
         99 |         17        0.18      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab beddiff[aweight=r13wtrespe],m

    beddiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 8,833.8805       93.86       93.86
          1 | 563.716726        5.99       99.85
         99 | 14.4028227        0.15      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *3. Identify people having diff received informal help
. gen beddiffinformal = 0

. replace beddiffinformal = 1 if beddiff ==1 & Informal ==1
(483 real changes made)

. replace beddiffinformal = 99 if beddiff ==99
(17 real changes made)

. tab beddiffinformal, m

beddiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,912       94.69       94.69
          1 |        483        5.13       99.82
         99 |         17        0.18      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *4. % of people who need help and received informal help
. tab beddiffinformal, m

beddiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,912       94.69       94.69
          1 |        483        5.13       99.82
         99 |         17        0.18      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab beddiffinformal[aweight=r13wtrespe], m

beddiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 9,029.6286       95.94       95.94
          1 |367.9685886        3.91       99.85
         99 | 14.4028227        0.15      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if beddiff ==1
(8,748 observations deleted)

. tab beddiffinformal, m

beddiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        181       27.26       27.26
          1 |        483       72.74      100.00
------------+-----------------------------------
      Total |        664      100.00

. tab beddiffinformal[aweight=r13wtrespe], m

beddiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 230.571061       34.72       34.72
          1 | 433.428939       65.28      100.00
------------+-----------------------------------
      Total |        664      100.00

. restore

. 
. **************************************************************
. *\ Mobility
. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having mobility diff
. tablist walkdiff beddiff

  +----------------------------------------------------------+
  | walkdiff   beddiff   _Freq_   _Perc_   _CFreq_   _CPerc_ |
  |----------------------------------------------------------|
  |        0         0     8273    87.90      8273     87.90 |
  |        1         0      454     4.82      8727     92.72 |
  |        1         1      368     3.91      9095     96.63 |
  |        0         1      295     3.13      9390     99.77 |
  |       99        99       12     0.13      9402     99.89 |
  |----------------------------------------------------------|
  |       99         0        4     0.04      9406     99.94 |
  |        0        99        3     0.03      9409     99.97 |
  |        1        99        2     0.02      9411     99.99 |
  |       99         1        1     0.01      9412    100.00 |
  +----------------------------------------------------------+

. gen mobilitydiff = 99

. replace mobilitydiff = 1 if walkdiff ==1 | beddiff ==1
(1,120 real changes made)

. replace mobilitydiff = 0 if walkdiff ==0 & beddiff ==0
(8,273 real changes made)

. tab mobilitydiff, m

mobilitydif |
          f |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,273       87.90       87.90
          1 |      1,120       11.90       99.80
         99 |         19        0.20      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *2. % of people who need mobility help
. tab mobilitydiff,m

mobilitydif |
          f |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,273       87.90       87.90
          1 |      1,120       11.90       99.80
         99 |         19        0.20      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab mobilitydiff[aweight=r13wtrespe],m

mobilitydif |
          f |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 8,459.3294       89.88       89.88
          1 | 937.022892        9.96       99.83
         99 | 15.6476896        0.17      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *3. Identify people having mobility diff received informal help
. gen mobilityiffinformal = 0

. replace mobilityiffinformal = 1 if mobilitydiff ==1 & Informal ==1
(769 real changes made)

. replace mobilityiffinformal = 99 if mobilitydiff ==99
(19 real changes made)

. tab mobilityiffinformal, m

mobilityiff |
   informal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,624       91.63       91.63
          1 |        769        8.17       99.80
         99 |         19        0.20      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *4. % of people who need help and received informal help
. tab mobilityiffinformal, m

mobilityiff |
   informal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,624       91.63       91.63
          1 |        769        8.17       99.80
         99 |         19        0.20      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab mobilityiffinformal[aweight=r13wtrespe], m

mobilityiff |
   informal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 8,800.4287       93.50       93.50
          1 | 595.923621        6.33       99.83
         99 | 15.6476896        0.17      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if mobilitydiff ==1
(8,292 observations deleted)

. tab mobilityiffinformal, m

mobilityiff |
   informal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        351       31.34       31.34
          1 |        769       68.66      100.00
------------+-----------------------------------
      Total |      1,120      100.00

. tab mobilityiffinformal[aweight=r13wtrespe], m

mobilityiff |
   informal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 407.707417       36.40       36.40
          1 | 712.292583       63.60      100.00
------------+-----------------------------------
      Total |      1,120      100.00

. restore

. 
. 
. **************************************************************
. **************************************************************
. **************************************************************
. *\ Self-Care
. *\ Diff-Eat 
. tab r13eat, m nolab

 r13eat:w13 |
          r |
diff-eating |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,001       95.63       95.63
          1 |        376        3.99       99.63
          2 |         14        0.15       99.78
          9 |          8        0.08       99.86
         .d |          1        0.01       99.87
         .s |         12        0.13      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff
. gen eatdiff = 99

. replace eatdiff = 1 if inlist(r13eat,1,2,9)
(398 real changes made)

. replace eatdiff = 0 if r13eat ==0
(9,001 real changes made)

. tab eatdiff, m

    eatdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,001       95.63       95.63
          1 |        398        4.23       99.86
         99 |         13        0.14      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *2. % of people who need help
. tab eatdiff,m

    eatdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,001       95.63       95.63
          1 |        398        4.23       99.86
         99 |         13        0.14      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab eatdiff[aweight=r13wtrespe],m

    eatdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 9,074.9604       96.42       96.42
          1 |  325.58924        3.46       99.88
         99 | 11.4503985        0.12      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *3. Identify people having diff received informal help
. gen eatdiffinformal = 0

. replace eatdiffinformal = 1 if eatdiff ==1 & Informal ==1
(333 real changes made)

. replace eatdiffinformal = 99 if eatdiff ==99
(13 real changes made)

. tab eatdiffinformal, m

eatdiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,066       96.32       96.32
          1 |        333        3.54       99.86
         99 |         13        0.14      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *4. % of people who need help and received informal help
. tab eatdiffinformal, m

eatdiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,066       96.32       96.32
          1 |        333        3.54       99.86
         99 |         13        0.14      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab eatdiffinformal[aweight=r13wtrespe], m

eatdiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 9,135.4674       97.06       97.06
          1 | 265.082173        2.82       99.88
         99 | 11.4503985        0.12      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if eatdiff ==1
(9,014 observations deleted)

. tab eatdiffinformal, m

eatdiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         65       16.33       16.33
          1 |        333       83.67      100.00
------------+-----------------------------------
      Total |        398      100.00

. tab eatdiffinformal[aweight=r13wtrespe], m

eatdiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 73.9637854       18.58       18.58
          1 | 324.036215       81.42      100.00
------------+-----------------------------------
      Total |        398      100.00

. restore

. 
. **************************************************************
. *\ Diff-Bath
. tab r13bath, m nolab

r13bath:w13 |
          r |
diff-bathin |
       g or |
   showerng |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,585       91.21       91.21
          1 |        793        8.43       99.64
          2 |         13        0.14       99.78
          9 |          5        0.05       99.83
         .d |          4        0.04       99.87
         .s |         12        0.13      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having bath diff
. gen bathdiff = 99

. replace bathdiff = 1 if inlist(r13bath,1,2,9)
(811 real changes made)

. replace bathdiff = 0 if r13bath ==0
(8,585 real changes made)

. tab bathdiff, m

   bathdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,585       91.21       91.21
          1 |        811        8.62       99.83
         99 |         16        0.17      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *2. % of people who need help
. tab bathdiff,m

   bathdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,585       91.21       91.21
          1 |        811        8.62       99.83
         99 |         16        0.17      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab bathdiff[aweight=r13wtrespe],m

   bathdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 8,744.4336       92.91       92.91
          1 | 654.330755        6.95       99.86
         99 |  13.235599        0.14      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *3. Identify people having diff received informal help
. gen bathdiffinformal = 0

. replace bathdiffinformal = 1 if bathdiff ==1 & Informal ==1
(640 real changes made)

. replace bathdiffinformal = 99 if bathdiff ==99
(16 real changes made)

. tab bathdiffinformal, m

bathdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,756       93.03       93.03
          1 |        640        6.80       99.83
         99 |         16        0.17      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *4. % of people who need help and received informal help
. tab bathdiffinformal, m

bathdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,756       93.03       93.03
          1 |        640        6.80       99.83
         99 |         16        0.17      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab bathdiffinformal[aweight=r13wtrespe], m

bathdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 8,910.3559       94.67       94.67
          1 | 488.408519        5.19       99.86
         99 |  13.235599        0.14      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if bathdiff ==1
(8,601 observations deleted)

. tab bathdiffinformal, m

bathdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        171       21.09       21.09
          1 |        640       78.91      100.00
------------+-----------------------------------
      Total |        811      100.00

. tab bathdiffinformal[aweight=r13wtrespe], m

bathdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 205.649716       25.36       25.36
          1 | 605.350284       74.64      100.00
------------+-----------------------------------
      Total |        811      100.00

. restore

. 
. **************************************************************
. *\ Diff-Toilt
. tab r13toilt, m nolab

r13toilt:w1 |
        3 r |
 diff-using |
 the toilet |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,749       92.96       92.96
          1 |        626        6.65       99.61
          2 |          9        0.10       99.70
          9 |         10        0.11       99.81
         .d |          6        0.06       99.87
         .s |         12        0.13      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff
. gen toiltdiff = 99

. replace toiltdiff = 1 if inlist(r13toilt,1,2,9)
(645 real changes made)

. replace toiltdiff = 0 if r13toilt ==0
(8,749 real changes made)

. tab toiltdiff, m

  toiltdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,749       92.96       92.96
          1 |        645        6.85       99.81
         99 |         18        0.19      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *2. % of people who need help
. tab toiltdiff,m

  toiltdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,749       92.96       92.96
          1 |        645        6.85       99.81
         99 |         18        0.19      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab toiltdiff[aweight=r13wtrespe],m

  toiltdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 8,870.2728       94.24       94.24
          1 | 527.445643        5.60       99.85
         99 |14.28160413        0.15      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *3. Identify people having diff received informal help
. gen toiltdiffinformal = 0

. replace toiltdiffinformal = 1 if toiltdiff ==1 & Informal ==1
(416 real changes made)

. replace toiltdiffinformal = 99 if toiltdiff ==99
(18 real changes made)

. tab toiltdiffinformal, m

toiltdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,978       95.39       95.39
          1 |        416        4.42       99.81
         99 |         18        0.19      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *4. % of people who need help and received informal help
. tab toiltdiffinformal, m

toiltdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,978       95.39       95.39
          1 |        416        4.42       99.81
         99 |         18        0.19      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab toiltdiffinformal[aweight=r13wtrespe], m

toiltdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,076.374       96.43       96.43
          1 | 321.344412        3.41       99.85
         99 |14.28160413        0.15      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if toiltdiff ==1
(8,767 observations deleted)

. tab toiltdiffinformal, m

toiltdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        229       35.50       35.50
          1 |        416       64.50      100.00
------------+-----------------------------------
      Total |        645      100.00

. tab toiltdiffinformal[aweight=r13wtrespe], m

toiltdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 252.036008       39.08       39.08
          1 | 392.963992       60.92      100.00
------------+-----------------------------------
      Total |        645      100.00

. restore

. 
. **************************************************************
. *\ Diff-Dress
. tab r13dress, m nolab

r13dress:w1 |
        3 r |
diff-dressi |
         ng |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,265       87.81       87.81
          1 |      1,094       11.62       99.44
          2 |         26        0.28       99.71
          9 |          8        0.08       99.80
         .d |          7        0.07       99.87
         .s |         12        0.13      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff
. gen dressdiff = 99

. replace dressdiff = 1 if inlist(r13dress,1,2,9)
(1,128 real changes made)

. replace dressdiff = 0 if r13dress ==0
(8,265 real changes made)

. tab dressdiff, m

  dressdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,265       87.81       87.81
          1 |      1,128       11.98       99.80
         99 |         19        0.20      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *2. % of people who need help
. tab dressdiff,m

  dressdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,265       87.81       87.81
          1 |      1,128       11.98       99.80
         99 |         19        0.20      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab dressdiff[aweight=r13wtrespe],m

  dressdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 8,442.2208       89.70       89.70
          1 | 950.552823       10.10       99.80
         99 |19.22640951        0.20      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *3. Identify people having diff received informal help
. gen dressdiffinformal = 0

. replace dressdiffinformal = 1 if dressdiff ==1 & Informal ==1
(754 real changes made)

. replace dressdiffinformal = 99 if dressdiff ==99
(19 real changes made)

. tab dressdiffinformal, m

dressdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,639       91.79       91.79
          1 |        754        8.01       99.80
         99 |         19        0.20      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *4. % of people who need help and received informal help
. tab dressdiffinformal, m

dressdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,639       91.79       91.79
          1 |        754        8.01       99.80
         99 |         19        0.20      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab dressdiffinformal[aweight=r13wtrespe], m

dressdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 8,807.2876       93.58       93.58
          1 | 585.485952        6.22       99.80
         99 |19.22640951        0.20      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if dressdiff ==1
(8,284 observations deleted)

. tab dressdiffinformal, m

dressdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        374       33.16       33.16
          1 |        754       66.84      100.00
------------+-----------------------------------
      Total |      1,128      100.00

. tab dressdiffinformal[aweight=r13wtrespe], m

dressdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 433.216776       38.41       38.41
          1 | 694.783224       61.59      100.00
------------+-----------------------------------
      Total |      1,128      100.00

. restore

. 
. **************************************************************
. *\ SELF-CARE
. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having self-care diff
. tablist eatdiff bathdiff toiltdiff dressdiff

  +--------------------------------------------------------------------------------+
  | eatdiff   bathdiff   toiltd~f   dressd~f   _Freq_   _Perc_   _CFreq_   _CPerc_ |
  |--------------------------------------------------------------------------------|
  |       0          0          0          0     7736    82.19      7736     82.19 |
  |       0          0          0          1      437     4.64      8173     86.84 |
  |       0          1          0          0      179     1.90      8352     88.74 |
  |       0          1          0          1      175     1.86      8527     90.60 |
  |       0          0          1          0      163     1.73      8690     92.33 |
  |--------------------------------------------------------------------------------|
  |       1          1          1          1      147     1.56      8837     93.89 |
  |       0          1          1          1      138     1.47      8975     95.36 |
  |       0          0          1          1      102     1.08      9077     96.44 |
  |       1          0          0          0       75     0.80      9152     97.24 |
  |       1          1          0          1       74     0.79      9226     98.02 |
  |--------------------------------------------------------------------------------|
  |       0          1          1          0       55     0.58      9281     98.61 |
  |       1          0          0          1       35     0.37      9316     98.98 |
  |       1          1          0          0       28     0.30      9344     99.28 |
  |       1          0          1          1       16     0.17      9360     99.45 |
  |       1          0          1          0       13     0.14      9373     99.59 |
  |--------------------------------------------------------------------------------|
  |      99         99         99         99       12     0.13      9385     99.71 |
  |       1          1          1          0        9     0.10      9394     99.81 |
  |       0          0         99          0        3     0.03      9397     99.84 |
  |       0          0          0         99        3     0.03      9400     99.87 |
  |       0          1          0         99        2     0.02      9402     99.89 |
  |--------------------------------------------------------------------------------|
  |       0         99          0          1        2     0.02      9404     99.92 |
  |       0          1         99          1        1     0.01      9405     99.93 |
  |       0          0         99          1        1     0.01      9406     99.94 |
  |      99          1          0          0        1     0.01      9407     99.95 |
  |       0         99          0          0        1     0.01      9408     99.96 |
  |--------------------------------------------------------------------------------|
  |       0          1          1         99        1     0.01      9409     99.97 |
  |       1          0          0         99        1     0.01      9410     99.98 |
  |       0         99          1          0        1     0.01      9411     99.99 |
  |       0          1         99          0        1     0.01      9412    100.00 |
  +--------------------------------------------------------------------------------+

. gen selfcarediff = 99

. replace selfcarediff = 1 if eatdiff ==1 | bathdiff ==1 | toiltdiff==1 | dressdiff==1
(1,657 real changes made)

. replace selfcarediff = 0 if eatdiff ==0 & bathdiff ==0 & toiltdiff==0 & dressdiff==0
(7,736 real changes made)

. tab selfcarediff, m

selfcaredif |
          f |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,736       82.19       82.19
          1 |      1,657       17.61       99.80
         99 |         19        0.20      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *2. % of people who need self-care help
. tab selfcarediff,m

selfcaredif |
          f |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,736       82.19       82.19
          1 |      1,657       17.61       99.80
         99 |         19        0.20      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab selfcarediff[aweight=r13wtrespe],m

selfcaredif |
          f |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 7,996.4289       84.96       84.96
          1 | 1,398.8491       14.86       99.82
         99 | 16.7220186        0.18      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *3. Identify people having self-care diff received informal help
. gen selfcarediffinformal = 0

. replace selfcarediffinformal = 1 if selfcarediff ==1 & Informal ==1
(1,032 real changes made)

. replace selfcarediffinformal = 99 if selfcarediff ==99
(19 real changes made)

. tab selfcarediffinformal, m

selfcaredif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,361       88.83       88.83
          1 |      1,032       10.96       99.80
         99 |         19        0.20      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *4. % of people who need help and received informal help
. tab selfcarediffinformal, m

selfcaredif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,361       88.83       88.83
          1 |      1,032       10.96       99.80
         99 |         19        0.20      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab selfcarediffinformal[aweight=r13wtrespe], m

selfcaredif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 8,579.6628       91.16       91.16
          1 |815.6151942        8.67       99.82
         99 | 16.7220186        0.18      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if selfcarediff ==1
(7,755 observations deleted)

. tab selfcarediffinformal, m

selfcaredif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        625       37.72       37.72
          1 |      1,032       62.28      100.00
------------+-----------------------------------
      Total |      1,657      100.00

. tab selfcarediffinformal[aweight=r13wtrespe], m

selfcaredif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |690.8669264       41.69       41.69
          1 |966.1330736       58.31      100.00
------------+-----------------------------------
      Total |      1,657      100.00

. restore

. 
. **************************************************************
. **************************************************************
. **************************************************************
. *\ Household Acticity
. *\ Diff-Shop
. tab r13shop, m nolab

r13shop:w13 |
r diff-shop |
        for |
  groceries |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,091       85.96       85.96
          1 |        829        8.81       94.77
          2 |        283        3.01       97.78
          9 |        195        2.07       99.85
         .d |          2        0.02       99.87
         .s |         12        0.13      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff
. gen shopdiff = 99

. replace shopdiff = 1 if inlist(r13shop,1,2,9)
(1,307 real changes made)

. replace shopdiff = 0 if r13shop ==0
(8,091 real changes made)

. tab shopdiff, m

   shopdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,091       85.96       85.96
          1 |      1,307       13.89       99.85
         99 |         14        0.15      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *2. % of people who need help
. tab shopdiff,m

   shopdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,091       85.96       85.96
          1 |      1,307       13.89       99.85
         99 |         14        0.15      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab shopdiff[aweight=r13wtrespe],m

   shopdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  8,308.058       88.27       88.27
          1 | 1,091.5334       11.60       99.87
         99 |12.40865882        0.13      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *3. Identify people having diff received informal help
. gen shopdiffinformal = 0

. replace shopdiffinformal = 1 if shopdiff ==1 & Informal ==1
(1,047 real changes made)

. replace shopdiffinformal = 99 if shopdiff ==99
(14 real changes made)

. tab shopdiffinformal, m

shopdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,351       88.73       88.73
          1 |      1,047       11.12       99.85
         99 |         14        0.15      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *4. % of people who need help and received informal help
. tab shopdiffinformal, m

shopdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,351       88.73       88.73
          1 |      1,047       11.12       99.85
         99 |         14        0.15      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab shopdiffinformal[aweight=r13wtrespe], m

shopdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  8,554.458       90.89       90.89
          1 | 845.133296        8.98       99.87
         99 |12.40865882        0.13      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if shopdiff ==1
(8,105 observations deleted)

. tab shopdiffinformal, m

shopdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        260       19.89       19.89
          1 |      1,047       80.11      100.00
------------+-----------------------------------
      Total |      1,307      100.00

. tab shopdiffinformal[aweight=r13wtrespe], m

shopdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |295.0389696       22.57       22.57
          1 |1,011.96103       77.43      100.00
------------+-----------------------------------
      Total |      1,307      100.00

. restore

. 
. 
. **************************************************************
. *\ Diff-Hotmeal
. tab r13meals, m nolab

r13meals:w1 |
        3 r |
diff-prepar |
    ing hot |
      meals |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,326       88.46       88.46
          1 |        618        6.57       95.03
          2 |        188        2.00       97.03
          9 |        264        2.80       99.83
         .d |          3        0.03       99.86
         .r |          1        0.01       99.87
         .s |         12        0.13      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having meal diff
. gen mealdiff = 99

. replace mealdiff = 1 if inlist(r13meals,1,2,9)
(1,070 real changes made)

. replace mealdiff = 0 if r13meals ==0
(8,326 real changes made)

. tab mealdiff, m

   mealdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,326       88.46       88.46
          1 |      1,070       11.37       99.83
         99 |         16        0.17      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *2. % of people who need help
. tab mealdiff,m

   mealdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,326       88.46       88.46
          1 |      1,070       11.37       99.83
         99 |         16        0.17      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab mealdiff[aweight=r13wtrespe],m

   mealdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 8,491.8625       90.22       90.22
          1 | 905.983617        9.63       99.85
         99 | 14.1538493        0.15      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *3. Identify people having meal diff received informal help
. gen mealdiffinformal = 0

. replace mealdiffinformal = 1 if mealdiff ==1 & Informal ==1
(772 real changes made)

. replace mealdiffinformal = 99 if mealdiff ==99
(16 real changes made)

. tab mealdiffinformal, m

mealdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,624       91.63       91.63
          1 |        772        8.20       99.83
         99 |         16        0.17      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *4. % of people who need help and received informal help
. tab mealdiffinformal, m

mealdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,624       91.63       91.63
          1 |        772        8.20       99.83
         99 |         16        0.17      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab mealdiffinformal[aweight=r13wtrespe], m

mealdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 8,791.8329       93.41       93.41
          1 |606.0132824        6.44       99.85
         99 | 14.1538493        0.15      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if mealdiff ==1
(8,342 observations deleted)

. tab mealdiffinformal, m

mealdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        298       27.85       27.85
          1 |        772       72.15      100.00
------------+-----------------------------------
      Total |      1,070      100.00

. tab mealdiffinformal[aweight=r13wtrespe], m

mealdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 354.276007       33.11       33.11
          1 | 715.723993       66.89      100.00
------------+-----------------------------------
      Total |      1,070      100.00

. restore

. 
. **************************************************************
. *\ Diff-Handle Money
. tab r13money, m nolab

r13money:w1 |
        3 r |
diff-managi |
   ng money |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,372       88.95       88.95
          1 |        574        6.10       95.05
          2 |        175        1.86       96.91
          9 |        267        2.84       99.75
         .d |          7        0.07       99.82
         .r |          5        0.05       99.87
         .s |         12        0.13      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff
. gen moneydiff = 99

. replace moneydiff = 1 if inlist(r13money,1,2,9)
(1,016 real changes made)

. replace moneydiff = 0 if r13money ==0
(8,372 real changes made)

. tab moneydiff, m

  moneydiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,372       88.95       88.95
          1 |      1,016       10.79       99.75
         99 |         24        0.25      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *2. % of people who need help
. tab moneydiff,m

  moneydiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,372       88.95       88.95
          1 |      1,016       10.79       99.75
         99 |         24        0.25      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab moneydiff[aweight=r13wtrespe],m

  moneydiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 8,540.9008       90.74       90.74
          1 | 850.322915        9.03       99.78
         99 | 20.7763034        0.22      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *3. Identify people having diff received informal help
. gen moneydiffinformal = 0

. replace moneydiffinformal = 1 if moneydiff ==1 & Informal ==1
(727 real changes made)

. replace moneydiffinformal = 99 if moneydiff ==99
(24 real changes made)

. tab moneydiffinformal, m

moneydiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,661       92.02       92.02
          1 |        727        7.72       99.75
         99 |         24        0.25      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *4. % of people who need help and received informal help
. tab moneydiffinformal, m

moneydiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,661       92.02       92.02
          1 |        727        7.72       99.75
         99 |         24        0.25      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab moneydiffinformal[aweight=r13wtrespe], m

moneydiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 8,820.7603       93.72       93.72
          1 |  570.46337        6.06       99.78
         99 | 20.7763034        0.22      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if moneydiff ==1
(8,396 observations deleted)

. tab moneydiffinformal, m

moneydiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        289       28.44       28.44
          1 |        727       71.56      100.00
------------+-----------------------------------
      Total |      1,016      100.00

. tab moneydiffinformal[aweight=r13wtrespe], m

moneydiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 334.387434       32.91       32.91
          1 | 681.612566       67.09      100.00
------------+-----------------------------------
      Total |      1,016      100.00

. restore

. 
. 
. **************************************************************
. *\ Diff-Phone Call
. tab r13phone, m nolab

r13phone:w1 |
        3 r |
   diff-use |
  telephone |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,837       93.89       93.89
          1 |        464        4.93       98.82
          2 |         77        0.82       99.64
          9 |         20        0.21       99.85
         .d |          1        0.01       99.86
         .r |          1        0.01       99.87
         .s |         12        0.13      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff making phone call
. gen phoncalldiff = 99

. replace phoncalldiff = 1 if inlist(r13phone,1,2,9)
(561 real changes made)

. replace phoncalldiff = 0 if r13phone ==0
(8,837 real changes made)

. tab phoncalldiff, m

phoncalldif |
          f |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,837       93.89       93.89
          1 |        561        5.96       99.85
         99 |         14        0.15      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *2. % of people who need help
. tab phoncalldiff,m

phoncalldif |
          f |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,837       93.89       93.89
          1 |        561        5.96       99.85
         99 |         14        0.15      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab phoncalldiff[aweight=r13wtrespe],m

phoncalldif |
          f |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 8,960.4835       95.20       95.20
          1 | 439.458016        4.67       99.87
         99 | 12.0584719        0.13      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *3. Identify people having diff received informal help
. gen phoncalldiffinformal = 0

. replace phoncalldiffinformal = 1 if phoncalldiff ==1 & Informal ==1
(482 real changes made)

. replace phoncalldiffinformal = 99 if phoncalldiff ==99
(14 real changes made)

. tab phoncalldiffinformal, m

phoncalldif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,916       94.73       94.73
          1 |        482        5.12       99.85
         99 |         14        0.15      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *4. % of people who need help and received informal help
. tab phoncalldiffinformal, m

phoncalldif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,916       94.73       94.73
          1 |        482        5.12       99.85
         99 |         14        0.15      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab phoncalldiffinformal[aweight=r13wtrespe], m

phoncalldif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |9,034.52764       95.99       95.99
          1 | 365.413888        3.88       99.87
         99 | 12.0584719        0.13      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if phoncalldiff ==1
(8,851 observations deleted)

. tab phoncalldiffinformal, m

phoncalldif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         79       14.08       14.08
          1 |        482       85.92      100.00
------------+-----------------------------------
      Total |        561      100.00

. tab phoncalldiffinformal[aweight=r13wtrespe], m

phoncalldif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 94.5226943       16.85       16.85
          1 | 466.477306       83.15      100.00
------------+-----------------------------------
      Total |        561      100.00

. restore

. 
. **************************************************************
. *\ HOUSEHOLD ACTIVITY
. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff doing household acticities
. tablist shopdiff mealdiff moneydiff phoncalldiff

  +---------------------------------------------------------------------------------+
  | shopdiff   mealdiff   moneyd~f   phonca~f   _Freq_   _Perc_   _CFreq_   _CPerc_ |
  |---------------------------------------------------------------------------------|
  |        0          0          0          0     7254    77.07      7254     77.07 |
  |        1          0          0          0      386     4.10      7640     81.17 |
  |        0          0          1          0      338     3.59      7978     84.76 |
  |        1          1          0          0      271     2.88      8249     87.64 |
  |        1          1          1          1      256     2.72      8505     90.36 |
  |---------------------------------------------------------------------------------|
  |        0          1          0          0      247     2.62      8752     92.99 |
  |        1          1          1          0      147     1.56      8899     94.55 |
  |        1          0          1          0      122     1.30      9021     95.85 |
  |        0          0          0          1      103     1.09      9124     96.94 |
  |        0          1          1          0       60     0.64      9184     97.58 |
  |---------------------------------------------------------------------------------|
  |        1          1          0          1       48     0.51      9232     98.09 |
  |        0          0          1          1       41     0.44      9273     98.52 |
  |        1          0          0          1       40     0.42      9313     98.95 |
  |        1          0          1          1       32     0.34      9345     99.29 |
  |        0          1          1          1       20     0.21      9365     99.50 |
  |---------------------------------------------------------------------------------|
  |        0          1          0          1       16     0.17      9381     99.67 |
  |       99         99         99         99       12     0.13      9393     99.80 |
  |        0          0         99          0        5     0.05      9398     99.85 |
  |        0          0          0         99        2     0.02      9400     99.87 |
  |        0         99          0          0        2     0.02      9402     99.89 |
  |---------------------------------------------------------------------------------|
  |        1          1         99          1        2     0.02      9404     99.92 |
  |        0          1         99          0        2     0.02      9406     99.94 |
  |        1          0         99          1        2     0.02      9408     99.96 |
  |        0         99         99          0        1     0.01      9409     99.97 |
  |        1         99          0          0        1     0.01      9410     99.98 |
  |---------------------------------------------------------------------------------|
  |       99          1          0          0        1     0.01      9411     99.99 |
  |       99          0          0          1        1     0.01      9412    100.00 |
  +---------------------------------------------------------------------------------+

. gen householddiff = 99

. replace householddiff = 1 if shopdiff ==1 | mealdiff ==1 | moneydiff==1 | phoncalldiff==1
(2,136 real changes made)

. replace householddiff = 0 if shopdiff ==0 & mealdiff ==0 & moneydiff==0 & phoncalldiff==0
(7,254 real changes made)

. tab householddiff, m

householddi |
         ff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,254       77.07       77.07
          1 |      2,136       22.69       99.77
         99 |         22        0.23      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *2. % of people who need household help
. tab householddiff,m

householddi |
         ff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,254       77.07       77.07
          1 |      2,136       22.69       99.77
         99 |         22        0.23      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab householddiff[aweight=r13wtrespe],m

householddi |
         ff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 7,546.8321       80.18       80.18
          1 | 1,846.6664       19.62       99.80
         99 | 18.5014751        0.20      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *3. Identify people having household diff received informal help
. gen householddiffinformal = 0

. replace householddiffinformal = 1 if householddiff ==1 & Informal ==1
(1,426 real changes made)

. replace householddiffinformal = 99 if householddiff ==99
(22 real changes made)

. tab householddiffinformal, m

householddi |
 ffinformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,964       84.62       84.62
          1 |      1,426       15.15       99.77
         99 |         22        0.23      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *4. % of people who need help and received informal help
. tab householddiffinformal, m

householddi |
 ffinformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      7,964       84.62       84.62
          1 |      1,426       15.15       99.77
         99 |         22        0.23      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab householddiffinformal[aweight=r13wtrespe], m

householddi |
 ffinformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  8,230.775       87.45       87.45
          1 | 1,162.7235       12.35       99.80
         99 | 18.5014751        0.20      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if householddiff ==1
(7,276 observations deleted)

. tab householddiffinformal, m

householddi |
 ffinformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        710       33.24       33.24
          1 |      1,426       66.76      100.00
------------+-----------------------------------
      Total |      2,136      100.00

. tab householddiffinformal[aweight=r13wtrespe], m

householddi |
 ffinformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 791.102329       37.04       37.04
          1 | 1,344.8977       62.96      100.00
------------+-----------------------------------
      Total |      2,136      100.00

. restore

. 
. 
. **************************************************************
. **************************************************************
. **************************************************************
. *\ Medicare
. tab r13meds, m nolab

r13meds:w13 |
r diff-take |
medications |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,871       94.25       94.25
          1 |        421        4.47       98.73
          2 |          7        0.07       98.80
          9 |         10        0.11       98.91
         .d |          2        0.02       98.93
         .r |          1        0.01       98.94
         .s |         12        0.13       99.07
         .z |         88        0.93      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff taking madications
. gen medsdiff = 99

. replace medsdiff = 1 if inlist(r13meds,1,2,9)
(438 real changes made)

. replace medsdiff = 0 if r13meds ==0
(8,871 real changes made)

. tab medsdiff, m

   medsdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,871       94.25       94.25
          1 |        438        4.65       98.91
         99 |        103        1.09      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *2. % of people who need help
. tab medsdiff,m

   medsdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,871       94.25       94.25
          1 |        438        4.65       98.91
         99 |        103        1.09      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab medsdiff[aweight=r13wtrespe],m

   medsdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 8,939.8783       94.98       94.98
          1 |362.2501237        3.85       98.83
         99 | 109.871535        1.17      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *3. Identify people having diff received informal help
. gen medsdiffinformal = 0

. replace medsdiffinformal = 1 if medsdiff ==1 & Informal ==1
(357 real changes made)

. replace medsdiffinformal = 99 if medsdiff ==99
(103 real changes made)

. tab medsdiffinformal, m

medsdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,952       95.11       95.11
          1 |        357        3.79       98.91
         99 |        103        1.09      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. *4. % of people who need help and received informal help
. tab medsdiffinformal, m

medsdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      8,952       95.11       95.11
          1 |        357        3.79       98.91
         99 |        103        1.09      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. tab medsdiffinformal[aweight=r13wtrespe], m

medsdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  9,020.066       95.84       95.84
          1 | 282.062474        3.00       98.83
         99 | 109.871535        1.17      100.00
------------+-----------------------------------
      Total |      9,412      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if medsdiff ==1
(8,974 observations deleted)

. tab medsdiffinformal, m

medsdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         81       18.49       18.49
          1 |        357       81.51      100.00
------------+-----------------------------------
      Total |        438      100.00

. tab medsdiffinformal[aweight=r13wtrespe], m

medsdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 96.9556346       22.14       22.14
          1 | 341.044365       77.86      100.00
------------+-----------------------------------
      Total |        438      100.00

. restore

. 
. 
. capture log close
