-------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/Sophia/Desktop/Research/Norma/ICinLTC/log/Table2_nursinghome.log
  log type:  text
 opened on:  10 Dec 2021, 09:35:01

. 
. *\ Import datasets- 2016 Biennial and Longitudinal
. *1. Read in the 2016 Rand Biennial Data and select five variables
. use ph115 ph124 ph130 ph004 hhidpn using "$data/h16f2a.dta", clear

. tempfile 2016biennial

. save `2016biennial'
file /var/folders/0c/cmyfzq7x4zsbb_8fq5ly69ch0000gn/T//S_01662.000001 saved as .dta format

. *2. Load Rand HRS Longitudinal File 2016 and subset to only include wave13
. use inw13 r13agey_e r13nhmliv r13walkr r13dress r13bath r13eat r13bed r13toilt ///
> r13phone r13money r13meds r13shop r13meals hhidpn r13wtrespe using "$data/randhrs1992_2016v2.dta",cle
> ar

. keep if inw13==1
(21,140 observations deleted)

. tempfile 2016longitudinal

. save `2016longitudinal'
file /var/folders/0c/cmyfzq7x4zsbb_8fq5ly69ch0000gn/T//S_01662.000002 saved as .dta format

. *3. Merge two datasets
. use `2016longitudinal', clear

. merge 1:1 hhidpn using `2016biennial',gen (merge_1)

    Result                      Number of obs
    -----------------------------------------
    Not matched                             0
    Matched                            20,912  (merge_1==3)
    -----------------------------------------

. distinct hhidpn 

-------------------------------
        |     total   distinct
--------+----------------------
 hhidpn |     20912      20912
-------------------------------

. *4. Sample restrictions
. keep if r13agey_e>=65
(10,918 observations deleted)

. 
. *\ Generate Vars
. *1. Rename vars
. *** Rename PH115 (Group Meals) as Meals 
. tab ph115, m nolab 

group meals |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        240        2.40        2.40
          3 |          2        0.02        2.42
          4 |          7        0.07        2.49
          5 |        325        3.25        5.74
          8 |          4        0.04        5.78
          . |      9,416       94.22      100.00
------------+-----------------------------------
      Total |      9,994      100.00

. rename ph115 Meals

. *** Rename PH124 as ADLHELP
. tab ph124, m nolab 

bathing-dre |
ssing-eatin |
          g |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        153        1.53        1.53
          5 |        406        4.06        5.59
          8 |         10        0.10        5.69
          . |      9,425       94.31      100.00
------------+-----------------------------------
      Total |      9,994      100.00

. rename ph124 ADLHELP 

. *** Rename PH130 as NURSINGHELP
. tab ph130, m nolab 

    nursing |
       care |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        165        1.65        1.65
          5 |        398        3.98        5.63
          8 |          5        0.05        5.68
          9 |          1        0.01        5.69
          . |      9,425       94.31      100.00
------------+-----------------------------------
      Total |      9,994      100.00

. rename ph130 NURSINGHELP

. *** Rename PH004 as LTCRENT
. tab ph004, m nolab 

   own-rent |
       home |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      6,943       69.47       69.47
          2 |      1,624       16.25       85.72
          3 |        394        3.94       89.66
          7 |         61        0.61       90.27
          8 |          6        0.06       90.33
          9 |          9        0.09       90.42
          . |        957        9.58      100.00
------------+-----------------------------------
      Total |      9,994      100.00

. rename ph004 LTCRENT

. 
. *2. Formal Rensidential LTC Care
. *** Independent Living = Meals Yes, ADL HELP No, Nursing No, RENT Yes;
. gen IL = 0

. replace IL = 1 if Meals ==1 & ADLHELP ==5 & NURSINGHELP ==5 & LTCRENT ==2
(53 real changes made)

. tab IL, m 

         IL |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,941       99.47       99.47
          1 |         53        0.53      100.00
------------+-----------------------------------
      Total |      9,994      100.00

. *** Assisted Living = Meals Yes, ADL HELP Yes, Nursing No, RENT Yes;
. gen AL = 0

. replace AL = 1 if Meals ==1 & ADLHELP == 1 & NURSINGHELP ==5 & LTCRENT == 2
(22 real changes made)

. tab AL, m

         AL |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,972       99.78       99.78
          1 |         22        0.22      100.00
------------+-----------------------------------
      Total |      9,994      100.00

. *** Continuing Care Retirement Community = Meals Yes, ADL HELP Yes, Nursing Yes, RENT or Own (What ab
> out fee?)
. gen CCRC = 0 

. replace CCRC = 1 if Meals ==1 & ADLHELP ==1 & NURSINGHELP ==1
(111 real changes made)

. tab CCRC,m 

       CCRC |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      9,883       98.89       98.89
          1 |        111        1.11      100.00
------------+-----------------------------------
      Total |      9,994      100.00

. *** Combine three above because frequencies are so low for them separately
. gen FC_COMBO = 0

. replace FC_COMBO = 1 if CCRC ==1 | AL ==1 | IL ==1 
(186 real changes made)

. 
. *\ Identify people who are currently living in a nursing home
. tab r13nhmliv CCRC, m

r13nhmliv: |
  w13 live |
   in nurs |
   home at |         CCRC
     iview |         0          1 |     Total
-----------+----------------------+----------
      0.no |     9,487        100 |     9,587 
     1.yes |       396         11 |       407 
-----------+----------------------+----------
     Total |     9,883        111 |     9,994 

. keep if r13nhmliv == 1 & CCRC!=1 & FC_COMBO==0
(9,598 observations deleted)

. tab r13nhmliv CCRC, m //396 obs remain.

r13nhmliv: |
  w13 live |
   in nurs |
   home at |    CCRC
     iview |         0 |     Total
-----------+-----------+----------
     1.yes |       396 |       396 
-----------+-----------+----------
     Total |       396 |       396 

. *** Save as a tempfile
. tempfile nursinghome

. save `nursinghome'
file /var/folders/0c/cmyfzq7x4zsbb_8fq5ly69ch0000gn/T//S_01662.000003 saved as .dta format

. 
. clear all

. *\ Import dataset- HRS 2016 core helper file
. infile using "$data/H16G_HP.dct", using("$data/H16G_HP.da")

dictionary using c:\hrs2016\data\H16G_HP.da {
* Note: change location of input file to match your situation.
 _column(1) str6 HHID %6s "HOUSEHOLD IDENTIFICATION NUMBER"
 _column(7) str3 PN %3s "RESPONDENT PERSON IDENTIFICATION NUMBER"
 _column(10) str1 PSUBHH %1s "2016 SUB HOUSEHOLD IDENTIFICATION NUMBER"
 _column(11) str1 OSUBHH %1s "2014 SUB HOUSEHOLD IDENTIFICATION NUMBER"
 _column(12) str3 PPN_SP %3s "2016 SPOUSE/PARTNER PERSON NUMBER"
 _column(15) byte PCSR %1.0f "2016 WHETHER COVERSHEET RESPONDENT"
 _column(16) byte PFAMR %1.0f "2016 WHETHER FAMILY RESPONDENT"
 _column(17) byte PFINR %1.0f "2016 WHETHER FINANCIAL RESPONDENT"
 _column(18) str3 OPN %3s "OTHER PERSON NUMBER"
 _column(21) byte PG069 %2.0f "HELPER RELATIONSHIP"
 _column(23) int PG066 %3.0f "WHO HELPED LOOP"
 _column(26) byte PADLNDX %1.0f "INDEX CONNECTION TO THE ADL TABLE"
 _column(27) byte PIADLNDX %1.0f "INDEX CONNECTION TO THE IADL TABLE"
 _column(28) byte PMNYNDX %1.0f "INDEX CONNECTION TO THE MONEY TABLE"
 _column(29) byte PG070 %2.0f "FREQ OF HELP GIVEN"
 _column(31) byte PG071 %1.0f "# DAYS HELPER HELPED"
 _column(32) byte PG072 %1.0f "DID HELPER HELP EVERY DY"
 _column(33) byte PG073 %2.0f "#HRS OF HELP"
 _column(35) byte PG074 %1.0f "HELPERS SEX"
 _column(36) str3 PG075 %3s "GRANDCHILD OF WHICH CHILD"
 _column(39) byte PG076 %1.0f "HELPER GIVEN MONEY TO HELP"
 _column(40) byte PG077 %1.0f "DOES INS PAY"
 _column(41) long PG078 %5.0f "AMT R/SP/P PAID"
 _column(46) byte PG079 %1.0f "AMT R/SP/P PAID HELPER"
 _column(47) byte PG080 %1.0f "AMT $100"
 _column(48) byte PG081 %1.0f "OTR FIN HELP"
 _column(49) byte PG082 %1.0f "HELPER=CHLD,REL,OTR"
 _column(50) str3 PG083 %3s "WHICH CHLD"
 _column(53) byte PVDATE %2.0f "2016 DATA MODEL VERSION"
 _column(55) byte PVERSION %1.0f "2016 DATA RELEASE VERSION"
}

(6,239 observations read)

. *1. Gen hhidpn using HHID and PN
. gen hhidpn = HHID+PN

. listsome hhidpn

      +-----------+
      |    hhidpn |
      |-----------|
   1. | 010003030 |
   2. | 010063010 |
   3. | 010099010 |
   4. | 010099010 |
   5. | 010106020 |
      |-----------|
   6. | 010106020 |
   7. | 010147010 |
   8. | 010210020 |
   9. | 010210020 |
  10. | 010210020 |
      |-----------|
  11. | 010210020 |
  12. | 010281010 |
  13. | 010281010 |
  14. | 010281010 |
  15. | 010395020 |
      |-----------|
  16. | 010395020 |
  17. | 010395020 |
  18. | 010433010 |
  19. | 010433010 |
  20. | 010433010 |
      +-----------+

. codebook hhidpn

-------------------------------------------------------------------------------------------------------
hhidpn                                                                                      (unlabeled)
-------------------------------------------------------------------------------------------------------

                  Type: String (str9)

         Unique values: 3,345                     Missing "": 0/6,239

              Examples: "051029010"
                        "159075010"
                        "213443010"
                        "541451020"

. destring hhidpn, replace
hhidpn: all characters numeric; replaced as long

. *2. Make 6 relationship categories from dozens of options for helper relationships
. gen rel_cat = 0

. replace rel_cat = 1 if inlist(PG069,21,22,23,24,25) //Professional
(882 real changes made)

. replace rel_cat = 2 if inlist(PG069,2,26,27) //Spouse/Partner
(1,388 real changes made)

. replace rel_cat = 3 if inlist(PG069,3,8) //Son/Daughter in Law
(1,011 real changes made)

. replace rel_cat = 4 if inlist(PG069,5,6) //Daughter/Son in law
(1,531 real changes made)

. replace rel_cat = 5 if inlist(PG069,4,7,9,10,11,12,13,14,15,16,17,18,19,28,30,31,33,90,91)
(986 real changes made)

. replace rel_cat = 6 if inlist(PG069,20,32,34,98)
(438 real changes made)

. replace rel_cat = 99 if PG069 == 98 //0 represents self
(0 real changes made)

. tab rel_cat, m

    rel_cat |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |          3        0.05        0.05
          1 |        882       14.14       14.18
          2 |      1,388       22.25       36.43
          3 |      1,011       16.20       52.64
          4 |      1,531       24.54       77.18
          5 |        986       15.80       92.98
          6 |        438        7.02      100.00
------------+-----------------------------------
      Total |      6,239      100.00

. *3. Informal helpers
. gen Informal = 0

. replace Informal = 1 if PG076 == 5 & inlist(rel_cat,1,6,99)
(340 real changes made)

. replace Informal = 1 if inlist(rel_cat,2,3,4,5)
(4,916 real changes made)

. tab Informal,m

   Informal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        983       15.76       15.76
          1 |      5,256       84.24      100.00
------------+-----------------------------------
      Total |      6,239      100.00

. *4. Keep if Informal equals to 1
. keep if Informal == 1
(983 observations deleted)

. distinct hhidpn //5,256 obs, 3131 distinct obs.

-------------------------------
        |     total   distinct
--------+----------------------
 hhidpn |      5256       3131
-------------------------------

. duplicates r

Duplicates in terms of all variables

--------------------------------------
   Copies | Observations       Surplus
----------+---------------------------
        1 |         5256             0
--------------------------------------

. bys hhidpn: gen dup = cond(_N==1,0,_n)

. tab dup,m

        dup |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,834       34.89       34.89
          1 |      1,297       24.68       59.57
          2 |      1,297       24.68       84.25
          3 |        496        9.44       93.68
          4 |        198        3.77       97.45
          5 |         81        1.54       98.99
          6 |         37        0.70       99.70
          7 |         14        0.27       99.96
          8 |          2        0.04      100.00
------------+-----------------------------------
      Total |      5,256      100.00

. drop if dup>1
(2,125 observations deleted)

. distinct hhidpn //3131 obs, good.

-------------------------------
        |     total   distinct
--------+----------------------
 hhidpn |      3131       3131
-------------------------------

. *5. Save as a temp file
. tempfile helper

. save `helper'
file /var/folders/0c/cmyfzq7x4zsbb_8fq5ly69ch0000gn/T//S_01662.000004 saved as .dta format

. *6. Merge with the NursingHome
. use `nursinghome',clear

. merge m:1 hhidpn using `helper', gen(merge_2)

    Result                      Number of obs
    -----------------------------------------
    Not matched                         3,011
        from master                       138  (merge_2==1)
        from using                      2,873  (merge_2==2)

    Matched                               258  (merge_2==3)
    -----------------------------------------

. *7. Drop if merge_2 (unmatched from using)
. drop if merge_2==2
(2,873 observations deleted)

. *8. Save as a temp file
. tempfile FinalData

. save `FinalData'
file /var/folders/0c/cmyfzq7x4zsbb_8fq5ly69ch0000gn/T//S_01662.000005 saved as .dta format

. *9. Informal var: give NA a numeric number 0
. tab Informal, m

   Informal |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        258       65.15       65.15
          . |        138       34.85      100.00
------------+-----------------------------------
      Total |        396      100.00

. replace Informal = 0 if mi(Informal)
(138 real changes made)

. tab Informal, m

   Informal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        138       34.85       34.85
          1 |        258       65.15      100.00
------------+-----------------------------------
      Total |        396      100.00

. 
. 
. ****************************************************************************************************
. ***Table 2- Nursing Home***
. ***************************
. *\ Mobility
. *\ Diff-Walk
. tab r13walkr, m nolab

r13walkr:w1 |
        3 r |
  diff-walk |
across room |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        145       36.62       36.62
          1 |        202       51.01       87.63
          2 |         36        9.09       96.72
          9 |         11        2.78       99.49
         .s |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff
. gen walkdiff = 99

. replace walkdiff = 1 if inlist(r13walkr,1,2,9)
(249 real changes made)

. replace walkdiff = 0 if r13walkr ==0
(145 real changes made)

. tab walkdiff, m

   walkdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        145       36.62       36.62
          1 |        249       62.88       99.49
         99 |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. *2. % of people who need help
. tab walkdiff,m

   walkdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        145       36.62       36.62
          1 |        249       62.88       99.49
         99 |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab walkdiff[aweight=r13wtrespe],m

   walkdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 144.268431       36.43       36.43
          1 |   249.6976       63.05       99.49
         99 | 2.03396929        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. *3. Identify people having diff received informal help
. gen walkdiffinformal = 0

. replace walkdiffinformal = 1 if walkdiff ==1 & Informal ==1
(185 real changes made)

. replace walkdiffinformal = 99 if walkdiff ==99
(2 real changes made)

. tab walkdiffinformal, m

walkdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        209       52.78       52.78
          1 |        185       46.72       99.49
         99 |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. *4. % of people who need help and received informal help
. tab walkdiffinformal, m

walkdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        209       52.78       52.78
          1 |        185       46.72       99.49
         99 |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab walkdiffinformal[aweight=r13wtrespe], m

walkdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 206.197437       52.07       52.07
          1 | 187.768593       47.42       99.49
         99 | 2.03396929        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if walkdiff ==1
(147 observations deleted)

. tab walkdiffinformal, m

walkdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         64       25.70       25.70
          1 |        185       74.30      100.00
------------+-----------------------------------
      Total |        249      100.00

. tab walkdiffinformal[aweight=r13wtrespe], m

walkdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 61.7559908       24.80       24.80
          1 | 187.244009       75.20      100.00
------------+-----------------------------------
      Total |        249      100.00

. restore

. 
. **************************************************************
. *\ Diff-Bed
. tab r13bed, m nolab

 r13bed:w13 |
 r diff-get |
  in/out of |
        bed |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        177       44.70       44.70
          1 |        193       48.74       93.43
          2 |         20        5.05       98.48
          9 |          3        0.76       99.24
         .d |          1        0.25       99.49
         .s |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff
. gen beddiff = 99

. replace beddiff = 1 if inlist(r13bed,1,2,9)
(216 real changes made)

. replace beddiff = 0 if r13bed ==0
(177 real changes made)

. tab beddiff, m

    beddiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        177       44.70       44.70
          1 |        216       54.55       99.24
         99 |          3        0.76      100.00
------------+-----------------------------------
      Total |        396      100.00

. *2. % of people who need help
. tab beddiff,m

    beddiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        177       44.70       44.70
          1 |        216       54.55       99.24
         99 |          3        0.76      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab beddiff[aweight=r13wtrespe],m

    beddiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 184.393235       46.56       46.56
          1 | 208.271513       52.59       99.16
         99 | 3.33525252        0.84      100.00
------------+-----------------------------------
      Total |        396      100.00

. *3. Identify people having diff received informal help
. gen beddiffinformal = 0

. replace beddiffinformal = 1 if beddiff ==1 & Informal ==1
(169 real changes made)

. replace beddiffinformal = 99 if beddiff ==99
(3 real changes made)

. tab beddiffinformal, m

beddiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        224       56.57       56.57
          1 |        169       42.68       99.24
         99 |          3        0.76      100.00
------------+-----------------------------------
      Total |        396      100.00

. *4. % of people who need help and received informal help
. tab beddiffinformal, m

beddiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        224       56.57       56.57
          1 |        169       42.68       99.24
         99 |          3        0.76      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab beddiffinformal[aweight=r13wtrespe], m

beddiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 226.856036       57.29       57.29
          1 | 165.808711       41.87       99.16
         99 | 3.33525252        0.84      100.00
------------+-----------------------------------
      Total |        396      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if beddiff ==1
(180 observations deleted)

. tab beddiffinformal, m

beddiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         47       21.76       21.76
          1 |        169       78.24      100.00
------------+-----------------------------------
      Total |        216      100.00

. tab beddiffinformal[aweight=r13wtrespe], m

beddiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 44.0385006       20.39       20.39
          1 |171.9614994       79.61      100.00
------------+-----------------------------------
      Total |        216      100.00

. restore

. 
. **************************************************************
. *\ Mobility
. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having mobility diff
. tablist walkdiff beddiff

  +----------------------------------------------------------+
  | walkdiff   beddiff   _Freq_   _Perc_   _CFreq_   _CPerc_ |
  |----------------------------------------------------------|
  |        1         1      193    48.74       193     48.74 |
  |        0         0      121    30.56       314     79.29 |
  |        1         0       56    14.14       370     93.43 |
  |        0         1       23     5.81       393     99.24 |
  |       99        99        2     0.51       395     99.75 |
  |----------------------------------------------------------|
  |        0        99        1     0.25       396    100.00 |
  +----------------------------------------------------------+

. gen mobilitydiff = 99

. replace mobilitydiff = 1 if walkdiff ==1 | beddiff ==1
(272 real changes made)

. replace mobilitydiff = 0 if walkdiff ==0 & beddiff ==0
(121 real changes made)

. tab mobilitydiff, m

mobilitydif |
          f |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        121       30.56       30.56
          1 |        272       68.69       99.24
         99 |          3        0.76      100.00
------------+-----------------------------------
      Total |        396      100.00

. *2. % of people who need mobility help
. tab mobilitydiff,m

mobilitydif |
          f |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        121       30.56       30.56
          1 |        272       68.69       99.24
         99 |          3        0.76      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab mobilitydiff[aweight=r13wtrespe],m

mobilitydif |
          f |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 121.277872       30.63       30.63
          1 | 271.386876       68.53       99.16
         99 | 3.33525252        0.84      100.00
------------+-----------------------------------
      Total |        396      100.00

. *3. Identify people having mobility diff received informal help
. gen mobilityiffinformal = 0

. replace mobilityiffinformal = 1 if mobilitydiff ==1 & Informal ==1
(202 real changes made)

. replace mobilityiffinformal = 99 if mobilitydiff ==99
(3 real changes made)

. tab mobilityiffinformal, m

mobilityiff |
   informal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        191       48.23       48.23
          1 |        202       51.01       99.24
         99 |          3        0.76      100.00
------------+-----------------------------------
      Total |        396      100.00

. *4. % of people who need help and received informal help
. tab mobilityiffinformal, m

mobilityiff |
   informal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        191       48.23       48.23
          1 |        202       51.01       99.24
         99 |          3        0.76      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab mobilityiffinformal[aweight=r13wtrespe], m

mobilityiff |
   informal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 188.463545       47.59       47.59
          1 | 204.201202       51.57       99.16
         99 | 3.33525252        0.84      100.00
------------+-----------------------------------
      Total |        396      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if mobilitydiff ==1
(124 observations deleted)

. tab mobilityiffinformal, m

mobilityiff |
   informal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         70       25.74       25.74
          1 |        202       74.26      100.00
------------+-----------------------------------
      Total |        272      100.00

. tab mobilityiffinformal[aweight=r13wtrespe], m

mobilityiff |
   informal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 67.3374611       24.76       24.76
          1 | 204.662539       75.24      100.00
------------+-----------------------------------
      Total |        272      100.00

. restore

. 
. 
. **************************************************************
. **************************************************************
. **************************************************************
. *\ Self-Care
. *\ Diff-Eat 
. tab r13eat, m nolab

 r13eat:w13 |
          r |
diff-eating |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        224       56.57       56.57
          1 |        153       38.64       95.20
          2 |         11        2.78       97.98
          9 |          4        1.01       98.99
         .d |          1        0.25       99.24
         .r |          1        0.25       99.49
         .s |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff
. gen eatdiff = 99

. replace eatdiff = 1 if inlist(r13eat,1,2,9)
(168 real changes made)

. replace eatdiff = 0 if r13eat ==0
(224 real changes made)

. tab eatdiff, m

    eatdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        224       56.57       56.57
          1 |        168       42.42       98.99
         99 |          4        1.01      100.00
------------+-----------------------------------
      Total |        396      100.00

. *2. % of people who need help
. tab eatdiff,m

    eatdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        224       56.57       56.57
          1 |        168       42.42       98.99
         99 |          4        1.01      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab eatdiff[aweight=r13wtrespe],m

    eatdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 233.604813       58.99       58.99
          1 | 158.406382       40.00       98.99
         99 | 3.98880504        1.01      100.00
------------+-----------------------------------
      Total |        396      100.00

. *3. Identify people having diff received informal help
. gen eatdiffinformal = 0

. replace eatdiffinformal = 1 if eatdiff ==1 & Informal ==1
(142 real changes made)

. replace eatdiffinformal = 99 if eatdiff ==99
(4 real changes made)

. tab eatdiffinformal, m

eatdiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        250       63.13       63.13
          1 |        142       35.86       98.99
         99 |          4        1.01      100.00
------------+-----------------------------------
      Total |        396      100.00

. *4. % of people who need help and received informal help
. tab eatdiffinformal, m

eatdiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        250       63.13       63.13
          1 |        142       35.86       98.99
         99 |          4        1.01      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab eatdiffinformal[aweight=r13wtrespe], m

eatdiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 256.378239       64.74       64.74
          1 | 135.632956       34.25       98.99
         99 | 3.98880504        1.01      100.00
------------+-----------------------------------
      Total |        396      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if eatdiff ==1
(228 observations deleted)

. tab eatdiffinformal, m

eatdiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         26       15.48       15.48
          1 |        142       84.52      100.00
------------+-----------------------------------
      Total |        168      100.00

. tab eatdiffinformal[aweight=r13wtrespe], m

eatdiffinfo |
       rmal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 24.1526613       14.38       14.38
          1 | 143.847339       85.62      100.00
------------+-----------------------------------
      Total |        168      100.00

. restore

. 
. **************************************************************
. *\ Diff-Bath
. tab r13bath, m nolab

r13bath:w13 |
          r |
diff-bathin |
       g or |
   showerng |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        103       26.01       26.01
          1 |        269       67.93       93.94
          2 |         21        5.30       99.24
          9 |          1        0.25       99.49
         .s |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having bath diff
. gen bathdiff = 99

. replace bathdiff = 1 if inlist(r13bath,1,2,9)
(291 real changes made)

. replace bathdiff = 0 if r13bath ==0
(103 real changes made)

. tab bathdiff, m

   bathdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        103       26.01       26.01
          1 |        291       73.48       99.49
         99 |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. *2. % of people who need help
. tab bathdiff,m

   bathdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        103       26.01       26.01
          1 |        291       73.48       99.49
         99 |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab bathdiff[aweight=r13wtrespe],m

   bathdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 105.791631       26.72       26.72
          1 |   288.1744       72.77       99.49
         99 | 2.03396929        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. *3. Identify people having diff received informal help
. gen bathdiffinformal = 0

. replace bathdiffinformal = 1 if bathdiff ==1 & Informal ==1
(225 real changes made)

. replace bathdiffinformal = 99 if bathdiff ==99
(2 real changes made)

. tab bathdiffinformal, m

bathdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        169       42.68       42.68
          1 |        225       56.82       99.49
         99 |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. *4. % of people who need help and received informal help
. tab bathdiffinformal, m

bathdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        169       42.68       42.68
          1 |        225       56.82       99.49
         99 |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab bathdiffinformal[aweight=r13wtrespe], m

bathdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 163.622728       41.32       41.32
          1 | 230.343303       58.17       99.49
         99 | 2.03396929        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if bathdiff ==1
(105 observations deleted)

. tab bathdiffinformal, m

bathdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         66       22.68       22.68
          1 |        225       77.32      100.00
------------+-----------------------------------
      Total |        291      100.00

. tab bathdiffinformal[aweight=r13wtrespe], m

bathdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 58.3981406       20.07       20.07
          1 | 232.601859       79.93      100.00
------------+-----------------------------------
      Total |        291      100.00

. restore

. 
. **************************************************************
. *\ Diff-Toilt
. tab r13toilt, m nolab

r13toilt:w1 |
        3 r |
 diff-using |
 the toilet |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        176       44.44       44.44
          1 |        191       48.23       92.68
          2 |         17        4.29       96.97
          9 |          9        2.27       99.24
         .d |          1        0.25       99.49
         .s |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff
. gen toiltdiff = 99

. replace toiltdiff = 1 if inlist(r13toilt,1,2,9)
(217 real changes made)

. replace toiltdiff = 0 if r13toilt ==0
(176 real changes made)

. tab toiltdiff, m

  toiltdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        176       44.44       44.44
          1 |        217       54.80       99.24
         99 |          3        0.76      100.00
------------+-----------------------------------
      Total |        396      100.00

. *2. % of people who need help
. tab toiltdiff,m

  toiltdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        176       44.44       44.44
          1 |        217       54.80       99.24
         99 |          3        0.76      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab toiltdiff[aweight=r13wtrespe],m

  toiltdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 177.377302       44.79       44.79
          1 |215.0925223       54.32       99.11
         99 | 3.53017548        0.89      100.00
------------+-----------------------------------
      Total |        396      100.00

. *3. Identify people having diff received informal help
. gen toiltdiffinformal = 0

. replace toiltdiffinformal = 1 if toiltdiff ==1 & Informal ==1
(172 real changes made)

. replace toiltdiffinformal = 99 if toiltdiff ==99
(3 real changes made)

. tab toiltdiffinformal, m

toiltdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        221       55.81       55.81
          1 |        172       43.43       99.24
         99 |          3        0.76      100.00
------------+-----------------------------------
      Total |        396      100.00

. *4. % of people who need help and received informal help
. tab toiltdiffinformal, m

toiltdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        221       55.81       55.81
          1 |        172       43.43       99.24
         99 |          3        0.76      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab toiltdiffinformal[aweight=r13wtrespe], m

toiltdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 219.371556       55.40       55.40
          1 | 173.098269       43.71       99.11
         99 | 3.53017548        0.89      100.00
------------+-----------------------------------
      Total |        396      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if toiltdiff ==1
(179 observations deleted)

. tab toiltdiffinformal, m

toiltdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         45       20.74       20.74
          1 |        172       79.26      100.00
------------+-----------------------------------
      Total |        217      100.00

. tab toiltdiffinformal[aweight=r13wtrespe], m

toiltdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 42.3666656       19.52       19.52
          1 | 174.633334       80.48      100.00
------------+-----------------------------------
      Total |        217      100.00

. restore

. 
. **************************************************************
. *\ Diff-Dress
. tab r13dress, m nolab

r13dress:w1 |
        3 r |
diff-dressi |
         ng |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        126       31.82       31.82
          1 |        242       61.11       92.93
          2 |         21        5.30       98.23
          9 |          4        1.01       99.24
         .r |          1        0.25       99.49
         .s |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff
. gen dressdiff = 99

. replace dressdiff = 1 if inlist(r13dress,1,2,9)
(267 real changes made)

. replace dressdiff = 0 if r13dress ==0
(126 real changes made)

. tab dressdiff, m

  dressdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        126       31.82       31.82
          1 |        267       67.42       99.24
         99 |          3        0.76      100.00
------------+-----------------------------------
      Total |        396      100.00

. *2. % of people who need help
. tab dressdiff,m

  dressdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        126       31.82       31.82
          1 |        267       67.42       99.24
         99 |          3        0.76      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab dressdiff[aweight=r13wtrespe],m

  dressdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 126.926972       32.05       32.05
          1 | 265.863484       67.14       99.19
         99 | 3.20954446        0.81      100.00
------------+-----------------------------------
      Total |        396      100.00

. *3. Identify people having diff received informal help
. gen dressdiffinformal = 0

. replace dressdiffinformal = 1 if dressdiff ==1 & Informal ==1
(204 real changes made)

. replace dressdiffinformal = 99 if dressdiff ==99
(3 real changes made)

. tab dressdiffinformal, m

dressdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        189       47.73       47.73
          1 |        204       51.52       99.24
         99 |          3        0.76      100.00
------------+-----------------------------------
      Total |        396      100.00

. *4. % of people who need help and received informal help
. tab dressdiffinformal, m

dressdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        189       47.73       47.73
          1 |        204       51.52       99.24
         99 |          3        0.76      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab dressdiffinformal[aweight=r13wtrespe], m

dressdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |185.5815318       46.86       46.86
          1 | 207.208924       52.33       99.19
         99 | 3.20954446        0.81      100.00
------------+-----------------------------------
      Total |        396      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if dressdiff ==1
(129 observations deleted)

. tab dressdiffinformal, m

dressdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         63       23.60       23.60
          1 |        204       76.40      100.00
------------+-----------------------------------
      Total |        267      100.00

. tab dressdiffinformal[aweight=r13wtrespe], m

dressdiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 58.9052971       22.06       22.06
          1 | 208.094703       77.94      100.00
------------+-----------------------------------
      Total |        267      100.00

. restore

. 
. **************************************************************
. *\ SELF-CARE
. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having self-care diff
. tablist eatdiff bathdiff toiltdiff dressdiff

  +--------------------------------------------------------------------------------+
  | eatdiff   bathdiff   toiltd~f   dressd~f   _Freq_   _Perc_   _CFreq_   _CPerc_ |
  |--------------------------------------------------------------------------------|
  |       1          1          1          1      128    32.32       128     32.32 |
  |       0          0          0          0       76    19.19       204     51.52 |
  |       0          1          1          1       63    15.91       267     67.42 |
  |       0          1          0          1       34     8.59       301     76.01 |
  |       0          1          0          0       23     5.81       324     81.82 |
  |--------------------------------------------------------------------------------|
  |       1          1          0          1       20     5.05       344     86.87 |
  |       0          0          0          1       10     2.53       354     89.39 |
  |       1          1          0          0        9     2.27       363     91.67 |
  |       0          1          1          0        7     1.77       370     93.43 |
  |       0          0          1          1        6     1.52       376     94.95 |
  |--------------------------------------------------------------------------------|
  |       1          1          1          0        4     1.01       380     95.96 |
  |       0          0          1          0        4     1.01       384     96.97 |
  |       1          0          0          0        3     0.76       387     97.73 |
  |       1          0          1          1        3     0.76       390     98.48 |
  |      99         99         99         99        2     0.51       392     98.99 |
  |--------------------------------------------------------------------------------|
  |      99          1          1          1        1     0.25       393     99.24 |
  |       0          1         99          1        1     0.25       394     99.49 |
  |      99          1          1         99        1     0.25       395     99.75 |
  |       1          0          0          1        1     0.25       396    100.00 |
  +--------------------------------------------------------------------------------+

. gen selfcarediff = 99

. replace selfcarediff = 1 if eatdiff ==1 | bathdiff ==1 | toiltdiff==1 | dressdiff==1
(318 real changes made)

. replace selfcarediff = 0 if eatdiff ==0 & bathdiff ==0 & toiltdiff==0 & dressdiff==0
(76 real changes made)

. tab selfcarediff, m

selfcaredif |
          f |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         76       19.19       19.19
          1 |        318       80.30       99.49
         99 |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. *2. % of people who need self-care help
. tab selfcarediff,m

selfcaredif |
          f |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         76       19.19       19.19
          1 |        318       80.30       99.49
         99 |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab selfcarediff[aweight=r13wtrespe],m

selfcaredif |
          f |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 76.5525409       19.33       19.33
          1 |  317.41349       80.15       99.49
         99 | 2.03396929        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. *3. Identify people having self-care diff received informal help
. gen selfcarediffinformal = 0

. replace selfcarediffinformal = 1 if selfcarediff ==1 & Informal ==1
(236 real changes made)

. replace selfcarediffinformal = 99 if selfcarediff ==99
(2 real changes made)

. tab selfcarediffinformal, m

selfcaredif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        158       39.90       39.90
          1 |        236       59.60       99.49
         99 |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. *4. % of people who need help and received informal help
. tab selfcarediffinformal, m

selfcaredif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        158       39.90       39.90
          1 |        236       59.60       99.49
         99 |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab selfcarediffinformal[aweight=r13wtrespe], m

selfcaredif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 154.086812       38.91       38.91
          1 |239.8792186       60.58       99.49
         99 | 2.03396929        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if selfcarediff ==1
(78 observations deleted)

. tab selfcarediffinformal, m

selfcaredif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         82       25.79       25.79
          1 |        236       74.21      100.00
------------+-----------------------------------
      Total |        318      100.00

. tab selfcarediffinformal[aweight=r13wtrespe], m

selfcaredif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 77.6775375       24.43       24.43
          1 | 240.322463       75.57      100.00
------------+-----------------------------------
      Total |        318      100.00

. restore

. 
. **************************************************************
. **************************************************************
. **************************************************************
. *\ Household Acticity
. *\ Diff-Shop
. tab r13shop, m nolab

r13shop:w13 |
r diff-shop |
        for |
  groceries |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         75       18.94       18.94
          1 |        142       35.86       54.80
          2 |        134       33.84       88.64
          9 |         43       10.86       99.49
         .s |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff
. gen shopdiff = 99

. replace shopdiff = 1 if inlist(r13shop,1,2,9)
(319 real changes made)

. replace shopdiff = 0 if r13shop ==0
(75 real changes made)

. tab shopdiff, m

   shopdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         75       18.94       18.94
          1 |        319       80.56       99.49
         99 |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. *2. % of people who need help
. tab shopdiff,m

   shopdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         75       18.94       18.94
          1 |        319       80.56       99.49
         99 |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab shopdiff[aweight=r13wtrespe],m

   shopdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 74.4094665       18.79       18.79
          1 | 319.556564       80.70       99.49
         99 | 2.03396929        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. *3. Identify people having diff received informal help
. gen shopdiffinformal = 0

. replace shopdiffinformal = 1 if shopdiff ==1 & Informal ==1
(240 real changes made)

. replace shopdiffinformal = 99 if shopdiff ==99
(2 real changes made)

. tab shopdiffinformal, m

shopdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        154       38.89       38.89
          1 |        240       60.61       99.49
         99 |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. *4. % of people who need help and received informal help
. tab shopdiffinformal, m

shopdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        154       38.89       38.89
          1 |        240       60.61       99.49
         99 |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab shopdiffinformal[aweight=r13wtrespe], m

shopdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 151.064213       38.15       38.15
          1 | 242.901818       61.34       99.49
         99 | 2.03396929        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if shopdiff ==1
(77 observations deleted)

. tab shopdiffinformal, m

shopdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         79       24.76       24.76
          1 |        240       75.24      100.00
------------+-----------------------------------
      Total |        319      100.00

. tab shopdiffinformal[aweight=r13wtrespe], m

shopdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 76.5212383       23.99       23.99
          1 | 242.478762       76.01      100.00
------------+-----------------------------------
      Total |        319      100.00

. restore

. 
. 
. **************************************************************
. *\ Diff-Hotmeal
. tab r13meals, m nolab

r13meals:w1 |
        3 r |
diff-prepar |
    ing hot |
      meals |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         57       14.39       14.39
          1 |        140       35.35       49.75
          2 |        134       33.84       83.59
          9 |         62       15.66       99.24
         .d |          1        0.25       99.49
         .s |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having meal diff
. gen mealdiff = 99

. replace mealdiff = 1 if inlist(r13meals,1,2,9)
(336 real changes made)

. replace mealdiff = 0 if r13meals ==0
(57 real changes made)

. tab mealdiff, m

   mealdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         57       14.39       14.39
          1 |        336       84.85       99.24
         99 |          3        0.76      100.00
------------+-----------------------------------
      Total |        396      100.00

. *2. % of people who need help
. tab mealdiff,m

   mealdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         57       14.39       14.39
          1 |        336       84.85       99.24
         99 |          3        0.76      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab mealdiff[aweight=r13wtrespe],m

   mealdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 53.6249438       13.54       13.54
          1 |339.3477129       85.69       99.24
         99 | 3.02734325        0.76      100.00
------------+-----------------------------------
      Total |        396      100.00

. *3. Identify people having meal diff received informal help
. gen mealdiffinformal = 0

. replace mealdiffinformal = 1 if mealdiff ==1 & Informal ==1
(243 real changes made)

. replace mealdiffinformal = 99 if mealdiff ==99
(3 real changes made)

. tab mealdiffinformal, m

mealdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        150       37.88       37.88
          1 |        243       61.36       99.24
         99 |          3        0.76      100.00
------------+-----------------------------------
      Total |        396      100.00

. *4. % of people who need help and received informal help
. tab mealdiffinformal, m

mealdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        150       37.88       37.88
          1 |        243       61.36       99.24
         99 |          3        0.76      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab mealdiffinformal[aweight=r13wtrespe], m

mealdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 147.589452       37.27       37.27
          1 | 245.383205       61.97       99.24
         99 | 3.02734325        0.76      100.00
------------+-----------------------------------
      Total |        396      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if mealdiff ==1
(60 observations deleted)

. tab mealdiffinformal, m

mealdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         93       27.68       27.68
          1 |        243       72.32      100.00
------------+-----------------------------------
      Total |        336      100.00

. tab mealdiffinformal[aweight=r13wtrespe], m

mealdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 93.0375352       27.69       27.69
          1 | 242.962465       72.31      100.00
------------+-----------------------------------
      Total |        336      100.00

. restore

. 
. **************************************************************
. *\ Diff-Handle Money
. tab r13money, m nolab

r13money:w1 |
        3 r |
diff-managi |
   ng money |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         82       20.71       20.71
          1 |        145       36.62       57.32
          2 |        122       30.81       88.13
          9 |         44       11.11       99.24
         .d |          1        0.25       99.49
         .s |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff
. gen moneydiff = 99

. replace moneydiff = 1 if inlist(r13money,1,2,9)
(311 real changes made)

. replace moneydiff = 0 if r13money ==0
(82 real changes made)

. tab moneydiff, m

  moneydiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         82       20.71       20.71
          1 |        311       78.54       99.24
         99 |          3        0.76      100.00
------------+-----------------------------------
      Total |        396      100.00

. *2. % of people who need help
. tab moneydiff,m

  moneydiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         82       20.71       20.71
          1 |        311       78.54       99.24
         99 |          3        0.76      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab moneydiff[aweight=r13wtrespe],m

  moneydiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |78.62790975       19.86       19.86
          1 | 314.139474       79.33       99.18
         99 |  3.2326161        0.82      100.00
------------+-----------------------------------
      Total |        396      100.00

. *3. Identify people having diff received informal help
. gen moneydiffinformal = 0

. replace moneydiffinformal = 1 if moneydiff ==1 & Informal ==1
(252 real changes made)

. replace moneydiffinformal = 99 if moneydiff ==99
(3 real changes made)

. tab moneydiffinformal, m

moneydiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        141       35.61       35.61
          1 |        252       63.64       99.24
         99 |          3        0.76      100.00
------------+-----------------------------------
      Total |        396      100.00

. *4. % of people who need help and received informal help
. tab moneydiffinformal, m

moneydiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        141       35.61       35.61
          1 |        252       63.64       99.24
         99 |          3        0.76      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab moneydiffinformal[aweight=r13wtrespe], m

moneydiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 139.053379       35.11       35.11
          1 | 253.714005       64.07       99.18
         99 |  3.2326161        0.82      100.00
------------+-----------------------------------
      Total |        396      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if moneydiff ==1
(85 observations deleted)

. tab moneydiffinformal, m

moneydiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         59       18.97       18.97
          1 |        252       81.03      100.00
------------+-----------------------------------
      Total |        311      100.00

. tab moneydiffinformal[aweight=r13wtrespe], m

moneydiffin |
     formal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 59.8215841       19.24       19.24
          1 | 251.178416       80.76      100.00
------------+-----------------------------------
      Total |        311      100.00

. restore

. 
. 
. **************************************************************
. *\ Diff-Phone Call
. tab r13phone, m nolab

r13phone:w1 |
        3 r |
   diff-use |
  telephone |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        162       40.91       40.91
          1 |        158       39.90       80.81
          2 |         66       16.67       97.47
          9 |          6        1.52       98.99
         .d |          1        0.25       99.24
         .r |          1        0.25       99.49
         .s |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff making phone call
. gen phoncalldiff = 99

. replace phoncalldiff = 1 if inlist(r13phone,1,2,9)
(230 real changes made)

. replace phoncalldiff = 0 if r13phone ==0
(162 real changes made)

. tab phoncalldiff, m

phoncalldif |
          f |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        162       40.91       40.91
          1 |        230       58.08       98.99
         99 |          4        1.01      100.00
------------+-----------------------------------
      Total |        396      100.00

. *2. % of people who need help
. tab phoncalldiff,m

phoncalldif |
          f |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        162       40.91       40.91
          1 |        230       58.08       98.99
         99 |          4        1.01      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab phoncalldiff[aweight=r13wtrespe],m

phoncalldif |
          f |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 160.200795       40.45       40.45
          1 |232.0863972       58.61       99.06
         99 | 3.71280794        0.94      100.00
------------+-----------------------------------
      Total |        396      100.00

. *3. Identify people having diff received informal help
. gen phoncalldiffinformal = 0

. replace phoncalldiffinformal = 1 if phoncalldiff ==1 & Informal ==1
(210 real changes made)

. replace phoncalldiffinformal = 99 if phoncalldiff ==99
(4 real changes made)

. tab phoncalldiffinformal, m

phoncalldif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        182       45.96       45.96
          1 |        210       53.03       98.99
         99 |          4        1.01      100.00
------------+-----------------------------------
      Total |        396      100.00

. *4. % of people who need help and received informal help
. tab phoncalldiffinformal, m

phoncalldif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        182       45.96       45.96
          1 |        210       53.03       98.99
         99 |          4        1.01      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab phoncalldiffinformal[aweight=r13wtrespe], m

phoncalldif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 176.403119       44.55       44.55
          1 | 215.884073       54.52       99.06
         99 | 3.71280794        0.94      100.00
------------+-----------------------------------
      Total |        396      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if phoncalldiff ==1
(166 observations deleted)

. tab phoncalldiffinformal, m

phoncalldif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         20        8.70        8.70
          1 |        210       91.30      100.00
------------+-----------------------------------
      Total |        230      100.00

. tab phoncalldiffinformal[aweight=r13wtrespe], m

phoncalldif |
  finformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 16.0566691        6.98        6.98
          1 | 213.943331       93.02      100.00
------------+-----------------------------------
      Total |        230      100.00

. restore

. 
. **************************************************************
. *\ HOUSEHOLD ACTIVITY
. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff doing household acticities
. tablist shopdiff mealdiff moneydiff phoncalldiff

  +---------------------------------------------------------------------------------+
  | shopdiff   mealdiff   moneyd~f   phonca~f   _Freq_   _Perc_   _CFreq_   _CPerc_ |
  |---------------------------------------------------------------------------------|
  |        1          1          1          1      217    54.80       217     54.80 |
  |        1          1          1          0       59    14.90       276     69.70 |
  |        0          0          0          0       27     6.82       303     76.52 |
  |        1          1          0          0       24     6.06       327     82.58 |
  |        0          1          0          0       17     4.29       344     86.87 |
  |---------------------------------------------------------------------------------|
  |        0          1          1          0       13     3.28       357     90.15 |
  |        0          0          1          0       10     2.53       367     92.68 |
  |        1          0          0          0        9     2.27       376     94.95 |
  |        1          0          1          1        3     0.76       379     95.71 |
  |        0          0          1          1        3     0.76       382     96.46 |
  |---------------------------------------------------------------------------------|
  |       99         99         99         99        2     0.51       384     96.97 |
  |        0          1          1          1        2     0.51       386     97.47 |
  |        0          0          0          1        2     0.51       388     97.98 |
  |        1          0          1          0        2     0.51       390     98.48 |
  |        1          1          0         99        1     0.25       391     98.74 |
  |---------------------------------------------------------------------------------|
  |        1          1         99          1        1     0.25       392     98.99 |
  |        0         99          1          0        1     0.25       393     99.24 |
  |        1          1          1         99        1     0.25       394     99.49 |
  |        1          0          0          1        1     0.25       395     99.75 |
  |        1          1          0          1        1     0.25       396    100.00 |
  +---------------------------------------------------------------------------------+

. gen householddiff = 99

. replace householddiff = 1 if shopdiff ==1 | mealdiff ==1 | moneydiff==1 | phoncalldiff==1
(367 real changes made)

. replace householddiff = 0 if shopdiff ==0 & mealdiff ==0 & moneydiff==0 & phoncalldiff==0
(27 real changes made)

. tab householddiff, m

householddi |
         ff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         27        6.82        6.82
          1 |        367       92.68       99.49
         99 |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. *2. % of people who need household help
. tab householddiff,m

householddi |
         ff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         27        6.82        6.82
          1 |        367       92.68       99.49
         99 |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab householddiff[aweight=r13wtrespe],m

householddi |
         ff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 29.6440297        7.49        7.49
          1 | 364.322001       92.00       99.49
         99 | 2.03396929        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. *3. Identify people having household diff received informal help
. gen householddiffinformal = 0

. replace householddiffinformal = 1 if householddiff ==1 & Informal ==1
(258 real changes made)

. replace householddiffinformal = 99 if householddiff ==99
(2 real changes made)

. tab householddiffinformal, m

householddi |
 ffinformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        136       34.34       34.34
          1 |        258       65.15       99.49
         99 |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. *4. % of people who need help and received informal help
. tab householddiffinformal, m

householddi |
 ffinformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        136       34.34       34.34
          1 |        258       65.15       99.49
         99 |          2        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab householddiffinformal[aweight=r13wtrespe], m

householddi |
 ffinformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 135.093252       34.11       34.11
          1 | 258.872779       65.37       99.49
         99 | 2.03396929        0.51      100.00
------------+-----------------------------------
      Total |        396      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if householddiff ==1
(29 observations deleted)

. tab householddiffinformal, m

householddi |
 ffinformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        109       29.70       29.70
          1 |        258       70.30      100.00
------------+-----------------------------------
      Total |        367      100.00

. tab householddiffinformal[aweight=r13wtrespe], m

householddi |
 ffinformal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 106.224341       28.94       28.94
          1 | 260.775659       71.06      100.00
------------+-----------------------------------
      Total |        367      100.00

. restore

. 
. 
. **************************************************************
. **************************************************************
. **************************************************************
. *\ Medicare
. tab r13meds, m nolab

r13meds:w13 |
r diff-take |
medications |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        212       53.54       53.54
          1 |        161       40.66       94.19
          2 |         12        3.03       97.22
          9 |          2        0.51       97.73
         .d |          2        0.51       98.23
         .s |          2        0.51       98.74
         .z |          5        1.26      100.00
------------+-----------------------------------
      Total |        396      100.00

. ***A. AMONG ALL SAMPLE POP
. *1. Identify people having diff taking madications
. gen medsdiff = 99

. replace medsdiff = 1 if inlist(r13meds,1,2,9)
(175 real changes made)

. replace medsdiff = 0 if r13meds ==0
(212 real changes made)

. tab medsdiff, m

   medsdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        212       53.54       53.54
          1 |        175       44.19       97.73
         99 |          9        2.27      100.00
------------+-----------------------------------
      Total |        396      100.00

. *2. % of people who need help
. tab medsdiff,m

   medsdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        212       53.54       53.54
          1 |        175       44.19       97.73
         99 |          9        2.27      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab medsdiff[aweight=r13wtrespe],m

   medsdiff |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 216.707537       54.72       54.72
          1 | 170.637367       43.09       97.81
         99 |8.655096728        2.19      100.00
------------+-----------------------------------
      Total |        396      100.00

. *3. Identify people having diff received informal help
. gen medsdiffinformal = 0

. replace medsdiffinformal = 1 if medsdiff ==1 & Informal ==1
(157 real changes made)

. replace medsdiffinformal = 99 if medsdiff ==99
(9 real changes made)

. tab medsdiffinformal, m

medsdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        230       58.08       58.08
          1 |        157       39.65       97.73
         99 |          9        2.27      100.00
------------+-----------------------------------
      Total |        396      100.00

. *4. % of people who need help and received informal help
. tab medsdiffinformal, m

medsdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        230       58.08       58.08
          1 |        157       39.65       97.73
         99 |          9        2.27      100.00
------------+-----------------------------------
      Total |        396      100.00

. tab medsdiffinformal[aweight=r13wtrespe], m

medsdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |  231.42271       58.44       58.44
          1 | 155.922193       39.37       97.81
         99 |8.655096728        2.19      100.00
------------+-----------------------------------
      Total |        396      100.00

. 
. ***B.AMONG PEOPLE WHO NEED HELP
. preserve

. keep if medsdiff ==1
(221 observations deleted)

. tab medsdiffinformal, m

medsdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |         18       10.29       10.29
          1 |        157       89.71      100.00
------------+-----------------------------------
      Total |        175      100.00

. tab medsdiffinformal[aweight=r13wtrespe], m

medsdiffinf |
      ormal |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 | 15.0913921        8.62        8.62
          1 | 159.908608       91.38      100.00
------------+-----------------------------------
      Total |        175      100.00

. restore

. 
. 
. capture log close
